{
  "category": "faq",
  "lastUpdated": "2025-05-28T04:11:28.068Z",
  "totalEntries": 4,
  "totalWordCount": 802,
  "entries": [
    {
      "id": "frequently-asked-questions-1748405488055",
      "title": "Frequently Asked Questions",
      "content": "Frequently Asked Questions - Student Help Center ADMISSIONS AND ENROLLMENT Q: How do I apply for admission to the university? A: Complete the online application at our admissions portal. Submit all required documents including transcripts, test scores, and essays by the application deadline. Q: What are the application deadlines? A: Fall semester: March 1st (priority), May 1st (final). Spring semester: October 1st. Summer: March 15th. Q: How do I check my application status? A: Log into your applicant portal using your student ID and password to view real-time application status updates. REGISTRATION AND COURSES Q: How do I register for classes? A: Use the online student portal during your assigned registration window. Contact your academic advisor if you need assistance with course selection. Q: What if a class I need is full? A: Add yourself to the waitlist through the registration system. You can also contact the department to request permission to enroll. Q: Can I change my schedule after registration? A: Yes, during the adddrop period (first two weeks of semester) you can make changes without penalty through the student portal. FINANCIAL INFORMATION Q: When is tuition due? A: Tuition and fees are due by the first day of classes each semester. Late payment fees apply after the deadline. Q: What payment methods are accepted? A: We accept online payments, checks, money orders, and credit cards. Payment plans are available through the bursars office. Q: How do I apply for financial aid? A: Complete the Free Application for Federal Student Aid (FAFSA) by March 1st for priority consideration. Visit our financial aid office for assistance. CAMPUS SERVICES Q: Where can I get academic help? A: The Academic Success Center offers tutoring, study groups, and learning resources. Contact your department advisor for subject-specific assistance. Q: How do I access campus Wi-Fi? A: Connect to Campus-WiFi using your student login credentials. Visit the IT help desk if you experience connection issues. Q: What dining options are available on campus? A: Multiple dining locations including cafeterias, food courts, and coffee shops. Meal plans are available for purchase through student services.",
      "source": "frequently-asked-questions.txt",
      "category": "faq",
      "type": "text",
      "priority": 5,
      "tags": [
        "academic",
        "course",
        "student",
        "service",
        "financial",
        "aid",
        "registration",
        "credit",
        "enrollment",
        "schedule",
        "tuition"
      ],
      "wordCount": 348,
      "lastUpdated": "2025-05-28T04:11:28.055Z"
    },
    {
      "id": "faq-test-1748405488055",
      "title": "Faq Test",
      "content": "Frequently Asked Questions Q: How do I register for classes? A: Use the online student portal during your registration window. Q: What is the deadline for tuition payment? A: Tuition is due by the first day of classes each semester. Q: How do I apply for financial aid? A: Complete the FAFSA by March 1st for priority consideration. Q: Where can I get academic advising? A: Contact your department advisor or visit the Academic Success Center.",
      "source": "faq-test.txt",
      "category": "faq",
      "type": "text",
      "priority": 4,
      "tags": [
        "academic",
        "student",
        "financial",
        "aid",
        "registration",
        "tuition"
      ],
      "wordCount": 76,
      "lastUpdated": "2025-05-28T04:11:28.055Z"
    },
    {
      "id": "course-registration-faq-1748405488049",
      "title": "Course Registration Faq",
      "content": "COURSE REGISTRATION FAQ COURSE REGISTRATION - FREQUENTLY ASKED QUESTIONS Q: When can I register for courses? A: Registration opens 6 weeks before the semester begins. Your specific registration date and time are based on your classification and total credit hours completed. Q: How do I register for courses? A: Use the online student portal to search for courses, check availability, and add courses to your schedule. You can also register by phone or in person at the Registrars Office. Q: What if the course I need is full? A: Add yourself to the waitlist through the online system. Youll be automatically enrolled if a spot opens up. You can also contact the academic department to request permission to enroll. Q: Can I change my schedule after registering? A: Yes! You can add or drop courses during the first two weeks of the semester without academic penalty. After the adddrop period, you may withdraw from courses but will receive a W grade. Q: What are prerequisites and how do I check them? A: Prerequisites are courses you must complete before enrolling in more advanced classes. Check the course catalog or speak with your advisor to verify youve met all requirements. Q: How many courses should I take per semester? A: Full-time status requires 12 credit hours. Most students take 15-16 credit hours (5-6 courses) per semester. Taking more than 18 credit hours requires advisor approval. Q: What if I have a scheduling conflict? A: Contact your academic advisor immediately. They can help you find alternative courses or sections that fit your schedule while meeting degree requirements. Q: How do I get help with course selection? A: Schedule an appointment with your academic advisor. They can help you plan your schedule, ensure youre meeting degree requirements, and discuss course options. For additional registration assistance, contact the Registrars Office or visit during walk-in advising hours.",
      "source": "course-registration-faq.pdf",
      "category": "faq",
      "type": "pdf",
      "priority": 3,
      "tags": [
        "academic",
        "requirement",
        "course",
        "student",
        "registration",
        "degree",
        "credit",
        "schedule",
        "prerequisite"
      ],
      "wordCount": 312,
      "lastUpdated": "2025-05-28T04:11:28.049Z"
    },
    {
      "id": "student-faq-1748405488063",
      "title": "Student Faq",
      "content": "Student FAQ Center How do I register for courses? Students can register for courses through the online student portal during their assigned registration window. What financial aid is available? Financial aid includes federal grants, loans, work-study programs, and institutional scholarships. Complete the FAFSA to apply. Where can I get academic help? The Academic Success Center offers tutoring, study groups, and learning support services for all students.",
      "source": "student-faq.html",
      "category": "faq",
      "type": "web",
      "priority": 2,
      "tags": [
        "academic",
        "course",
        "student",
        "service",
        "financial",
        "aid",
        "registration"
      ],
      "wordCount": 66,
      "lastUpdated": "2025-05-28T04:11:28.063Z"
    }
  ]
}
