{
  "page_title": "Foundation Studies - Plan FS022ADA",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/foundation-studies/foundation-studies-fs022/fs022adaauscy",
  "page_index": 19,
  "chunk_index": 1,
  "total_chunks": 4,
  "text": "user experience and learn to communicate your design thinking both verbally and in writing.Students must complete a series of compulsory onboarding modules during their first semester or study period. Semester One: Complete the following Four (4) Courses:Course TitleCredit PointsCourse CodeCampusExploring Narratives12LANG1382City CampusFundamentals of Visual Communication12GRAP2989City CampusMaterials and Design12GRAP2992City CampusDrawing and Studio Practice12VART3735City CampusANDSemester Two: Complete the following Two (2) Courses:Course TitleCredit PointsCourse CodeCampusComparative Texts12LANG1376City CampusStudio Investigation12OART1099City CampusANDSelect and Complete Two (2) of the following Courses:Course TitleCredit PointsCourse CodeCampusMultimedia12COMM2882City CampusMedia: Power and Persuasion12COMM2885City CampusCreative Narratives12LANG1379City CampusMarketing and Communication12MKTG1491City Campus CRICOS code: 108492M To complete the program you must complete the following : All courses listed may not be available each semesterYear One of ProgramThe Art, Design and Architecture stream provides the fundamental knowledge and skills required to prepare you for a wide range of higher education art and design programs. Through application of the design process, and exploration of a variety of materials and technologies, you will develop approaches to studio practice and produce creative solutions for a range of design problems. You will also engage with current and emerging issues including sustainability and user experience and learn to communicate your design thinking both verbally and in writing.Students must complete a series of compulsory onboarding modules during their first semester or study period.",
  "structured_data": {
    "course_code": "FS022",
    "campus": "Exploring Narratives | 12 | LANG1382 | City Campus Fundamentals of Visual Communication | 12 | GRAP2989 | City Campus Materials and Design | 12 | GRAP2992 | City Campus Drawing and Studio Practice | 12 | VART3735 | City Campus Comparative Texts | 12 | LANG1376 | City Campus Studio Investigation | 12 | OART1099 | City Campus Multimedia | 12 | COMM2882 | City Campus Media: Power and Persuasion | 12 | COMM2885 | City Campus Creative Narratives | 12 | LANG1379 | City Campus Marketing and Communication | 12 | MKTG1491 | City Campus CRICOS code: 108492MTo complete the program you must complete the following :  All courses listed may not be available each semesterYear One of ProgramThe Art, Design and Architecture stream provides the fundamental knowledge and skills required to prepare you for a wide range of higher education art and design programs"
  },
  "metadata": {
    "start_char": 1203,
    "end_char": 2949,
    "category": "course-information"
  }
}