{
  "page_title": "Foundation Studies - Plan FS022SHH",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/foundation-studies/foundation-studies-fs022/fs022shhauscy",
  "page_index": 23,
  "chunk_index": 1,
  "total_chunks": 3,
  "text": "each semester.Year One of ProgramThe Health stream introduces you to the fundamental knowledge and skills of chemical, biological and social sciences through a scientific inquiry approach to learning. This stream will prepare you for a wide range of health-related courses offered at RMIT.Students must complete a series of compulsory onboarding modules during their first semester or study period. Semester One: Complete the following Four (4) Courses:Course TitleCredit PointsCourse CodeCampusExploring Narratives12LANG1382City CampusGeneral Mathematics12MATH2433City CampusChemistry12CHEM1304City CampusBiology12BIOL2516City CampusANDSemester Two: Complete the following Two (2) Courses:Course TitleCredit PointsCourse CodeCampusComparative Texts12LANG1376City CampusStatistics and Probability12MATH2424City CampusANDSelect and Complete Two (2) of the following Courses:Course TitleCredit PointsCourse CodeCampusData Analytics12ISYS3452City CampusAdvanced Mathematics12MATH2427City CampusPsychology12BESC1567City CampusPhysics12PHYS2185City Campus To complete the program you must complete the following : All courses listed may not be available each semester. Year One of Program The Health stream introduces you to the fundamental knowledge and skills of chemical, biological and social sciences through a scientific inquiry approach to learning. This stream will prepare you for a wide range of health-related courses offered at RMIT. Students must complete a series of compulsory onboarding modules during their first semester or study period.",
  "structured_data": {
    "course_code": "FS022",
    "campus": "Exploring Narratives | 12 | LANG1382 | City Campus General Mathematics | 12 | MATH2433 | City Campus Chemistry | 12 | CHEM1304 | City Campus Biology | 12 | BIOL2516 | City Campus Comparative Texts | 12 | LANG1376 | City Campus Statistics and Probability | 12 | MATH2424 | City Campus Data Analytics | 12 | ISYS3452 | City Campus Advanced Mathematics | 12 | MATH2427 | City Campus Psychology | 12 | BESC1567 | City Campus Physics | 12 | PHYS2185 | City Campus CRICOS code: 108492MTo complete the program you must complete the following :  All courses listed may not be available each semester"
  },
  "metadata": {
    "start_char": 1799,
    "end_char": 3349,
    "category": "course-information"
  }
}