{
  "page_title": "Course Information",
  "page_url": "https://www.rmit.edu.au/study-with-us",
  "page_index": 0,
  "chunk_index": 2,
  "total_chunks": 6,
  "text": "management, or delve into property and valuation when you study building. BusinessExplore the future of business, from accounting, finance and management to blockchain, marketing and entrepreneurship. Business Explore the future of business, from accounting, finance and management to blockchain, marketing and entrepreneurship. CommunicationGet job ready with highly transferrable skills in advertising, journalism, marketing and much more. Communication Get job ready with highly transferrable skills in advertising, journalism, marketing and much more. Design EducationGain the practical skills to shape young minds through early childhood, primary and secondary school education, and more. Education Gain the practical skills to shape young minds through early childhood, primary and secondary school education, and more. EngineeringExplore a wide range of disciplines, from civil and mechanical to electrical and chemical, and even aerospace and biomedical engineering. Engineering Explore a wide range of disciplines, from civil and mechanical to electrical and chemical, and even aerospace and biomedical engineering. EnvironmentGain a deep understanding of the world’s current environmental challenges and the skills required to respond to them. Environment Gain a deep understanding of the world’s current environmental challenges and the skills required to respond to them. FashionFrom design to textile development, merchandising to marketing, build an inspired portfolio of work to help get your start in the fashion industry. Fashion From design to textile development, merchandising to marketing, build an inspired portfolio of work to help get your start in the fashion industry. HealthFind your place in the healthcare industry and choose from roles in mental health, nursing, medical science, complementary medicine and more. Health Find your place in the healthcare industry and choose from roles in mental health, nursing, medical science, complementary medicine and more.",
  "structured_data": {
    "career_outcomes": "with a postgraduate qualification"
  },
  "metadata": {
    "start_char": 3403,
    "end_char": 5394,
    "category": "course-information"
  }
}