{
  "page_title": "Foundation Studies",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/foundation-studies/foundation-studies-fs022",
  "page_index": 17,
  "chunk_index": 1,
  "total_chunks": 6,
  "text": "explore Melbourne, meet other students and have fun! The knowledge and skills you will acquire throughout this course and how they can be applied in your career are described in the learning outcomes.View the learning outcomes for each stream:Foundation Studies - FS022ADA - Art, Design and ArchitectureFoundation Studies - FS022BUS - BusinessFoundation Studies - FS022COM - Communication and Social ContextFoundation Studies - FS022SES - Engineering and ScienceFoundation Studies - FS022SHH - HealthFoundation Studies - FS022SIT - Information Technology (IT) The knowledge and skills you will acquire throughout this course and how they can be applied in your career are described in the learning outcomes. View the learning outcomes for each stream: Foundation Studies - FS022ADA - Art, Design and Architecture Foundation Studies - FS022BUS - Business Foundation Studies - FS022COM - Communication and Social Context Foundation Studies - FS022SES - Engineering and Science Foundation Studies - FS022SHH - Health Foundation Studies - FS022SIT - Information Technology (IT) RMIT Foundation Studies is a standard streamed Foundation program.Students study four subjects each semester.Each stream consists of six core and two elective subjects. These include two English subjects,Exploring Narratives and Comparative Texts, plus four specialised discipline subjects. In each stream, students choose two electives from the options* provided.There are six streams to choose from:Art, Design and ArchitectureBusinessCommunication and Social ContextEngineering and ScienceHealthInformation Technology (IT)Please note, you must enrol in the correct Foundation Studies stream to allow you to meet the requirements of your chosen degree.*The number of elective options and courses offered are subject to change. RMIT Foundation Studies is a standard streamed Foundation program. Students study four subjects each semester. Each stream consists of six core and two elective subjects.",
  "structured_data": {
    "course_code": "FS022",
    "campus": "tours and other events to help you explore Melbourne, meet other students and have fun! The knowledge and skills you will acquire throughout this course and how they can be applied in your career are described in the learning outcomes"
  },
  "metadata": {
    "start_char": 1376,
    "end_char": 3349,
    "category": "course-information"
  }
}