{
  "page_title": "Certificate IV in Training and Assessment - Plan C4436FST",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/certificates/certificate-iv-in-training-and-assessment-c4436/c4436fstauscy",
  "page_index": 194,
  "chunk_index": 4,
  "total_chunks": 7,
  "text": "st-Track INTENSIVE) Overview TheC4436FST (6-Month Fast-Track INTENSIVE)program is designed for those who wish to complete theCertificate IV in Training and Assessment (TAE40122)in a shorter timeframe. The program runs over19 weeksand combines structured online learning sessions withessential face-to-faceassessment observations. All delivery of course content takes place during the online learning sessions, while all formal assessments, including practical observations, are conducted during the face-to-face assessment observation sessions. Online Learning Sessions There are20 online learning sessionsdelivered viaCollaborate Ultra,scheduled onWednesday and Thursday evenings from 6:00 PM to 9:00 PMacross the program. These sessions are designed to deliver the core content of the qualification, supporting students to build the knowledge and skills required to complete assessment tasks. The online learning sessions provide: Structured delivery of training and course materials across all units. Guided walkthroughs of assessment expectations and requirements. Real-time support, clarification, and opportunities to ask questions. Face-to-Face Assessment Observation There are 17 face-to-face assessment observationdays scheduled on campus at the RMIT Melbourne City Campus. These sessions occur onMondays and Tuesdays from 8:30 AM to 4:30 PMthroughout the 19-week program. These face-to-face sessions are dedicated to completing assessment activities. All observed assessments, practical demonstrations, and competency-based tasks are conducted in these sessions. Students must attend these sessions in person to: Demonstrate skills and knowledge through practical assessment. Complete required observation checklists and evidence collection. Receive timely feedback from assessors in a structured environment. Time Commitment This fast-track program requires a significant time commitment, including: 20 evening online learning sessions(over 10 weeks).",
  "structured_data": {
    "course_code": "C4436",
    "campus": "Assess competence (TAEASS412) | 50 | TCHE5952C | City Campus Participate in assessment validation (TAEASS413) | 50 | TCHE5953C | City Campus Facilitate vocational training (TAEDEL411) | 45 | TCHE5954C | City Campus Use nationally recognised training products to meet vocational training needs (TAEDES411) | 25 | TCHE5955C | City Campus Design and develop plans for vocational training (TAEDES412) | 60 | TCHE5956C | City Campus Work effectively in the VET sector (TAEPDD401) | 40 | TCHE5957C | City Campus Plan, organise and facilitate online learning (TAEDEL405) | 40 | TCHE5959C | City Campus Facilitate workplace-based learning (TAEDEL412) | 25 | TCHE5960C | City Campus Provide work skill instruction (TAEDEL311) | 40 | TCHE5961C | City Campus Assess competence in an online environment (TAEASS404) | 40 | TCHE5962C | City Campus Make Presentations (BSBCMM411) | 30 | COMM5469C | City Campus Use foundation skills resources, strategies and advice (TAELLN422) | 30 | TCHE5964C | City Campus This qualification requires the completion of 6 core courses and 6 courses from the elective course list"
  },
  "metadata": {
    "start_char": 6710,
    "end_char": 8672,
    "category": "course-information"
  }
}