{
  "page_title": "Vocational study",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study",
  "page_index": 29,
  "chunk_index": 0,
  "total_chunks": 2,
  "text": "Apprenticeships and traineeshipsApprenticeships and traineeships combine training and employment, normally over three to four years. Learn on the job and earn money while studying.CertificatesStart gaining practical knowledge in your field and pick up job-specific skills with these technical qualifications.Diplomas and advanced diplomasGet the specialised knowledge you need to work in skilled or paraprofessional areas. These programs normally take one to two years of full-time study. Apprenticeships and traineeshipsApprenticeships and traineeships combine training and employment, normally over three to four years. Learn on the job and earn money while studying. Apprenticeships and traineeships Apprenticeships and traineeships combine training and employment, normally over three to four years. Learn on the job and earn money while studying. CertificatesStart gaining practical knowledge in your field and pick up job-specific skills with these technical qualifications. Certificates Start gaining practical knowledge in your field and pick up job-specific skills with these technical qualifications. Diplomas and advanced diplomasGet the specialised knowledge you need to work in skilled or paraprofessional areas. These programs normally take one to two years of full-time study. Diplomas and advanced diplomas Get the specialised knowledge you need to work in skilled or paraprofessional areas. These programs normally take one to two years of full-time study. Credit and recognitionRMIT recognises prior learning, so if you want to improve your current knowledge or skill level, you don’t necessarily have to start at certificate to finally walk away with an advanced diploma. Being acknowledged for previous study may reduce the duration of your course and save you money.Fee finderSo you’ve picked the course you want to study but want to find out how much you’ll pay to get started? Get an estimate of fees for your vocational education program.",
  "structured_data": {},
  "metadata": {
    "start_char": 0,
    "end_char": 1962,
    "category": "course-information"
  }
}