{
  "page_title": "Short courses and microcredentials",
  "page_url": "https://www.rmit.edu.au/study-with-us/short-courses",
  "page_index": 33,
  "chunk_index": 15,
  "total_chunks": 30,
  "text": "course supplements traditional teacher education by preparing you for full-time classroom work as a casual relief teacher (CRT). Global Communication SkillsIcon / Small / CalendarCreated with Sketch.16 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.SHORT COURSE | Duration 60 hours | Online | NEXT INTAKE 14 May 2025Created specifically for international education professionals, this course has been designed to help participants communicate more confidently and effectively in English in an international education workplace. Global Communication Skills Icon / Small / LocationCreated with Sketch.SHORT COURSE | Duration 60 hours | Online | NEXT INTAKE 14 May 2025 SHORT COURSE | Duration 60 hours | Online | NEXT INTAKE 14 May 2025 Created specifically for international education professionals, this course has been designed to help participants communicate more confidently and effectively in English in an international education workplace. Grammar FundamentalsIcon / Small / CalendarCreated with Sketch.16 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.SHORT COURSE | Duration 8 hours | Online | NEXT INTAKE 13 May 2025The Grammar Fundamentals workshops aim to build your awareness of English grammar as well as your confidence in describing it. The course is designed to prepare candidates for the CELTA course but is open to all proficient users of English who are interested in developing their understanding of its grammar. Grammar Fundamentals Icon / Small / LocationCreated with Sketch.SHORT COURSE | Duration 8 hours | Online | NEXT INTAKE 13 May 2025 SHORT COURSE | Duration 8 hours | Online | NEXT INTAKE 13 May 2025 The Grammar Fundamentals workshops aim to build your awareness of English grammar as well as your confidence in describing it. The course is designed to prepare candidates for the CELTA course but is open to all proficient users of English who are interested in developing their understanding of its grammar.",
  "structured_data": {
    "career_outcomes": "as a front end web developer",
    "duration": "12 weeks",
    "intake": "1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course"
  },
  "metadata": {
    "start_char": 25920,
    "end_char": 27898,
    "category": "course-information"
  }
}