{
  "page_title": "Courses for international students",
  "page_url": "https://www.rmit.edu.au/study-with-us/international-students/programs-for-international-students",
  "page_index": 4,
  "chunk_index": 0,
  "total_chunks": 2,
  "text": "English language courses and testsRMIT offers a variety of English language courses and tests to help you achieve your goals. Reach the level of English you need to gain entry to RMIT with an English for Academic Purposes course, sit your IELTS and PTE testing, plus a range of bespoke learning solutions including CELTA and Grammar Fundamentals.​Foundation studiesRMIT Foundation Studies is your direct pathway to RMIT degree courses, giving you the skills you need to be university ready. Choose from study streams (covering art, design and architecture, business, engineering and science, health, information technology and communication and social context), that align with your study goals and interests. English language courses and testsRMIT offers a variety of English language courses and tests to help you achieve your goals. Reach the level of English you need to gain entry to RMIT with an English for Academic Purposes course, sit your IELTS and PTE testing, plus a range of bespoke learning solutions including CELTA and Grammar Fundamentals.​ English language courses and tests RMIT offers a variety of English language courses and tests to help you achieve your goals. Reach the level of English you need to gain entry to RMIT with an English for Academic Purposes course, sit your IELTS and PTE testing, plus a range of bespoke learning solutions including CELTA and Grammar Fundamentals.​ Foundation studiesRMIT Foundation Studies is your direct pathway to RMIT degree courses, giving you the skills you need to be university ready. Choose from study streams (covering art, design and architecture, business, engineering and science, health, information technology and communication and social context), that align with your study goals and interests. Foundation studies RMIT Foundation Studies is your direct pathway to RMIT degree courses, giving you the skills you need to be university ready.",
  "structured_data": {
    "intake": "in Australia and key academic dates Prepare to arriveAll the things you will need to get organised before starting life as an international student at RMIT"
  },
  "metadata": {
    "start_char": 0,
    "end_char": 1914,
    "category": "course-information"
  }
}