{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 16,
  "chunk_index": 0,
  "total_chunks": 15,
  "text": "| Session 1 | Break | Session 2 Shift 1 | 8:20am - 10:20am | 10:20am - 10:50am | 10:50am - 12:50pm Shift 2 | 1:00pm - 3:00pm | 3:00pm - 3:30pm | 3:30pm - 5:30pm Classes are held from Monday to Friday in two x two hour shifts scheduled between 8.00am and 5.30pm.To assist our growing learning community in Australia, we offer classes in two ‘shifts’. Which shift you will study in will be dependent on your English level and class.Session 1BreakSession 2Shift 18:20am - 10:20am10:20am - 10:50am10:50am - 12:50pmShift 21:00pm - 3:00pm3:00pm - 3:30pm3:30pm - 5:30pmFor every four hours in the classroom, we recommend you do at least one hour of independent study every day.Each level of study consists of 200 hours, which takes 10 weeks full time to complete. Each level is delivered over two 5-week modules.We have start dates for new students every five weeks.Enrolment opens two weeks prior to the start of each module.You can access your timetable via Canvas. All class times are listed in Melbourne time. Classes are held from Monday to Friday in two x two hour shifts scheduled between 8.00am and 5.30pm.To assist our growing learning community in Australia, we offer classes in two ‘shifts’. Which shift you will study in will be dependent on your English level and class. Classes are held from Monday to Friday in two x two hour shifts scheduled between 8.00am and 5.30pm. To assist our growing learning community in Australia, we offer classes in two ‘shifts’. Which shift you will study in will be dependent on your English level and class. Session 1BreakSession 2Shift 18:20am - 10:20am10:20am - 10:50am10:50am - 12:50pmShift 21:00pm - 3:00pm3:00pm - 3:30pm3:30pm - 5:30pm Session 1 Break Session 2 Shift 1 8:20am - 10:20am 10:20am - 10:50am 10:50am - 12:50pm Shift 2 1:00pm - 3:00pm 3:00pm - 3:30pm 3:30pm - 5:30pm For every four hours in the classroom, we recommend you do at least one hour of independent study every day.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 0,
    "end_char": 1932,
    "category": "course-information"
  }
}