{
  "page_title": "RMIT University - Online Service Standards",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/rmit-university-online-service-standards",
  "page_index": 31,
  "chunk_index": 8,
  "total_chunks": 10,
  "text": "ides collaborative learning opportunities for students to interact with peers through; In-class and online discussion forums Webinars Case studies Role Play Simulations Practical industry experiences. Ongoing feedback will be given by trainers and assessors through discussion forums and online messaging, in response to individual student queries and through detailed feedback on assessments. RMIT closely monitors student progress and supports students to succeed in their studies. have not logged on to Canvas within 2 weeks of their first class commencing are at risk of not completing their studies within the agreed timeframes. The mode of delivery varies by Program and the training and assessment is delivered online, Face to Face or blended.Different types of assessment may be used for each unit. Assessments may include:knowledge questionsprojectspresentationsevidence portfoliosreports or case studiesdemonstration of practical skills.Where students are asked to demonstrate competency in practical skills, video technology may be used. The mode of delivery varies by Program and the training and assessment is delivered online, Face to Face or blended. Different types of assessment may be used for each unit. Assessments may include: knowledge questions projects presentations evidence portfolios reports or case studies demonstration of practical skills. Where students are asked to demonstrate competency in practical skills, video technology may be used. All trainers and assessors delivering online or blended programs at RMIT hold a minimum qualification of Certificate IV Training and Assessment and remain current in their industry or field of expertise. This enables trainers and assessors to deliver real world learning experiences.Trainers and assessors undertake internal professional development in blended and online delivery based on RMIT Capability Framework for Educators.",
  "structured_data": {},
  "metadata": {
    "start_char": 13678,
    "end_char": 15580,
    "category": "course-information"
  }
}