{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 16,
  "chunk_index": 3,
  "total_chunks": 15,
  "text": "IT UP is located at RMIT’s Melbourne City campus, in the heart of Melbourne. We are conveniently located between Swanston Street and Elizabeth street, just a short walk from Melbourne Central Station.The campus has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025). RMIT UP is located at:RMIT Building 85, Level 1, 97-99 Franklin Street. RMIT UP is located at: RMIT Building 85, Level 1, 97-99 Franklin Street. RMIT UP is located at RMIT’s Melbourne City campus, in the heart of Melbourne. We are conveniently located between Swanston Street and Elizabeth street, just a short walk from Melbourne Central Station. The campus has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025). RMIT offers a free* service that collects you from the airport and takes you to your pre-arranged accommodation. Please refer toPrepare to arrive webpagefor more information.Otherwise, you can catch a taxi or take theSkybusinto the city centre.*Conditions apply RMIT offers a free* service that collects you from the airport and takes you to your pre-arranged accommodation. Please refer toPrepare to arrive webpagefor more information. Otherwise, you can catch a taxi or take theSkybusinto the city centre. *Conditions apply Skills | Assessment task Grammar and Vocabulary | Online tests Reading | Mid-course and final examination Listening | Mid-course and final examination Writing | Mid-course and final examination Speaking | Speaking and presentations throughout the course Learn English to communicate in everyday situations. Delivery You will work in pairs, small groups and independently to complete class activities and tasks.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 5320,
    "end_char": 7286,
    "category": "course-information"
  }
}