{
  "page_title": "Fees",
  "page_url": "https://www.rmit.edu.au/study-with-us/applying-to-rmit/local-student-applications/fees",
  "page_index": 2,
  "chunk_index": 0,
  "total_chunks": 2,
  "text": "Pre-university studyFee information for Australian residents studying Foundation Skills, Victorian Certificate of Education, English language and tertiary preparation programs. Pre-university study Fee information for Australian residents studying Foundation Skills, Victorian Certificate of Education, English language and tertiary preparation programs. Apprenticeships and traineeshipsFee information for Australian residents studying trade apprenticeship and pre-apprenticeship programs through RMIT. Apprenticeships and traineeships Fee information for Australian residents studying trade apprenticeship and pre-apprenticeship programs through RMIT. Vocational studyFee information for Australian residents studying vocational education programs, including certificates, diplomas and advanced diplomas. Vocational study Fee information for Australian residents studying vocational education programs, including certificates, diplomas and advanced diplomas. Fees for undergraduate studyFee information for Australian residents studying undergraduate education programs, including bachelor, associate degree and honours programs. Fees for undergraduate study Fee information for Australian residents studying undergraduate education programs, including bachelor, associate degree and honours programs. Postgraduate studyFee information for Australian residents studying postgraduate education programs, including graduate certificate, graduate diploma and master by coursework programs. Postgraduate study Fee information for Australian residents studying postgraduate education programs, including graduate certificate, graduate diploma and master by coursework programs.",
  "structured_data": {
    "career_outcomes": "support, counselling and so much more!Other expenses (materials and admin fees)There may be other expenses associated with your study in addition to tuition fees"
  },
  "metadata": {
    "start_char": 0,
    "end_char": 1674,
    "category": "course-information"
  }
}