{
  "page_title": "RMIT University - Online Service Standards",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/rmit-university-online-service-standards",
  "page_index": 31,
  "chunk_index": 0,
  "total_chunks": 10,
  "text": "RMIT provides a range ofsupport services and programsto assist a student achieve their potential while studying online. These include:General study skillsAssignment writing resourcesMaths, Statistics, Physics and Chemistry resourcesEnglish language supportsReferencing guides and toolsLiteracy tools. RMIT provides a range ofsupport services and programsto assist a student achieve their potential while studying online. These include: General study skills Assignment writing resources Maths, Statistics, Physics and Chemistry resources English language supports Referencing guides and tools Literacy tools. Teaching staff will aim to reply to queries within 2 working days and assessment will be returned within 10 working days of submission. RMIT offers a range of student services and support through theStudent Connect portal.Students can reach services by phone and email, and via the online self-service portal system during:Monday - Thursday: 9 am to 5 pm; andFriday: 10 am to 5 pm.Services available through this portal are:Fees and Commonwealth assistance loansEnrolmentTimetablePersonal detailsGraduation and academic statementsCounselling services are available via video conference. RMIT offers a range of student services and support through theStudent Connect portal. Students can reach services by phone and email, and via the online self-service portal system during: Monday - Thursday: 9 am to 5 pm; and Friday: 10 am to 5 pm. Services available through this portal are: Fees and Commonwealth assistance loans Enrolment Timetable Personal details Graduation and academic statements Counselling services are available via video conference. The library collections are electronically indexed and available completely online. Much of the library’s digital collections are available through the library website.",
  "structured_data": {},
  "metadata": {
    "start_char": 0,
    "end_char": 1824,
    "category": "course-information"
  }
}