{
  "page_title": "Certificate III in Apparel, Fashion and Textiles - MST31022 - Apply",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/certificates/certificate-iii-in-apparel-fashion-and-textiles-c3417/apply-now",
  "page_index": 118,
  "chunk_index": 0,
  "total_chunks": 1,
  "text": "How to applyHelpful step-by-step how to apply guides, including everything you need to submit an application to RMIT - from entry requirements to the documentation you'll need to complete your application to selection tasks and more. How to apply Helpful step-by-step how to apply guides, including everything you need to submit an application to RMIT - from entry requirements to the documentation you'll need to complete your application to selection tasks and more. ScholarshipsAchieve your study goals with a scholarship. Each year scholarships are awarded to thousands of new and continuing students across RMIT study areas. Scholarships Achieve your study goals with a scholarship. Each year scholarships are awarded to thousands of new and continuing students across RMIT study areas. How to applyHelpful step-by-step how to apply guides, including everything you need to submit an application to RMIT - from entry requirements to the documentation you'll need to complete your application to selection tasks and more.FeesDiscover fee information and payment options for international students for programs and courses at RMIT University.ScholarshipsAchieve your study goals with a scholarship. Each year scholarships are awarded to new and continuing international students across RMIT study areas. FeesDiscover fee information and payment options for international students for programs and courses at RMIT University. Discover fee information and payment options for international students for programs and courses at RMIT University. ScholarshipsAchieve your study goals with a scholarship. Each year scholarships are awarded to new and continuing international students across RMIT study areas. Achieve your study goals with a scholarship. Each year scholarships are awarded to new and continuing international students across RMIT study areas.",
  "structured_data": {
    "course_code": "C3417",
    "prerequisites": "to the documentation you'll need to complete your application to selection tasks and more"
  },
  "metadata": {
    "start_char": null,
    "end_char": null,
    "category": "course-information"
  }
}