{
  "page_title": "C4411 - Certificate IV in Tertiary Preparation",
  "page_url": "http://www1.rmit.edu.au/browse;ID=SPGC4411HLTAUSCY;STATUS=A;SECTION=2;PAGE_AUTHOR=Program%20Guides",
  "page_index": 37,
  "chunk_index": 0,
  "total_chunks": 1,
  "text": "OverviewLearning outcomesProgram delivery and structure Overview Learning outcomes Program delivery and structure C4411 - Certificate IV in Tertiary Preparation Plan: C4411HLT - Certificate IV in Tertiary PreparationCampus: City Campus Employability Skills Foundation Skills This program supports you in the development of a range of Foundation Skills that are fundamental to your effective participation in the workplace, in the community, and in education and training. These Foundation Skills are a combination of language, literacy and numeracy (LLN) skills and employability skills, which are clustered under the headings: Navigate the world of work Interact with others Get the job done. In addition to developing the skills and knowledge required for a particular area of work, this program also aims to help you to develop broad work skills, known as Employability Skills. There are eight employability skills: communication teamwork problem solving initiative and enterprise planning and organising self-management learning technology Employability skills are “embedded” in the units of competency in your program. When you demonstrate that you are competent in your job skills and knowledge, you are also demonstrating that you have developed relevant employability skills. More information around Employability Skills can be provided by your teacher.",
  "structured_data": {
    "campus": "City Campus Statement on competency-based training Employability Skills Foundation Skills This program supports you in the development of a range of Foundation Skills that are fundamental to your effective participation in the workplace, in the community, and in education and training"
  },
  "metadata": {
    "start_char": null,
    "end_char": null,
    "category": "course-information"
  }
}