{
  "page_title": "Foundation Studies",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/foundation-studies/foundation-studies-fs022",
  "page_index": 17,
  "chunk_index": 3,
  "total_chunks": 6,
  "text": "dent visa holders must have cover for the total duration of their visa.Some programs incuradditional expenses.You also need to account for your living expenses. Estimate thecost of livingin Melbourne.In addition to tuition fees, you will be charged an annualstudent services and amenities fee (SSAF), which is used to maintain and enhance services and amenities that improve your experience as an RMIT student.The SSAF is calculated based on your enrolment load and the maximum fee for 2025 is $365. If you are undertaking Foundation Studies Art, Design and Architecture stream, you are required to purchase the Art, Design and Architecture materials kit to complete required assessment tasks during your program.The cost of this material kit in 2025 is approximately AU$626.96. This includes a 20% discount. If you are undertaking Foundation Studies Art, Design and Architecture stream, you are required to purchase the Art, Design and Architecture materials kit to complete required assessment tasks during your program. The cost of this material kit in 2025 is approximately AU$626.96. This includes a 20% discount. Art, Design and Architecture materials list (PDF) If you are undertaking any mathematics courses, you will be required to have a Ti-Nspire CX II CAS Graphing Calculator.This can be purchased fromOfficeworks. In 2025 the cost will be approximately AU$250. If you are undertaking any mathematics courses, you will be required to have a Ti-Nspire CX II CAS Graphing Calculator. This can be purchased fromOfficeworks. In 2025 the cost will be approximately AU$250. In addition to tuition fees you also need to pay for:Student services and amenities fee (SSAF) in each calendar year.Overseas Student Health Cover (OSHC)- Student visa holders must have cover for the total duration of their visa.Some programs incuradditional expenses.You also need to account for your living expenses. Estimate thecost of livingin Melbourne.",
  "structured_data": {
    "course_code": "FS022",
    "campus": "tours and other events to help you explore Melbourne, meet other students and have fun! The knowledge and skills you will acquire throughout this course and how they can be applied in your career are described in the learning outcomes"
  },
  "metadata": {
    "start_char": 4845,
    "end_char": 6783,
    "category": "course-information"
  }
}