{
  "page_title": "Levels of study",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study",
  "page_index": 5,
  "chunk_index": 0,
  "total_chunks": 2,
  "text": "High school studentsInformation for under 18 year olds planning to study at RMIT. High school students Information for under 18 year olds planning to study at RMIT. Vocational studyVocational study, sometimes known as TAFE, includes certificates, diplomas and advanced diplomas. Vocational study Vocational study, sometimes known as TAFE, includes certificates, diplomas and advanced diplomas. Undergraduate studyRMIT offers a range of bachelor, associate and honours degrees designed to equip you with skills and knowledge to succeed in your chosen career. Undergraduate study RMIT offers a range of bachelor, associate and honours degrees designed to equip you with skills and knowledge to succeed in your chosen career. Postgraduate studyDeepen your knowledge to advance your career with postgraduate courses including honours, graduate certificates, graduate diplomas and masters. Postgraduate study Deepen your knowledge to advance your career with postgraduate courses including honours, graduate certificates, graduate diplomas and masters. Pre-university studyPre-university study prepares you for success at university. You can improve your English, gain core knowledge in a new subject area or refresh your skills before entering an RMIT program. Pre-university study Pre-university study prepares you for success at university. You can improve your English, gain core knowledge in a new subject area or refresh your skills before entering an RMIT program. Apprenticeships and traineeshipsApprenticeships and traineeships combine training and employment. Learn on the job and earn money while studying a nationally recognised qualification. Apprenticeships and traineeships Apprenticeships and traineeships combine training and employment. Learn on the job and earn money while studying a nationally recognised qualification.",
  "structured_data": {
    "career_outcomes": "with postgraduate courses including honours, graduate certificates, graduate diplomas and masters"
  },
  "metadata": {
    "start_char": 0,
    "end_char": 1835,
    "category": "course-information"
  }
}