{
  "page_title": "Diploma of Business",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/diplomas/diploma-of-business-c5406",
  "page_index": 197,
  "chunk_index": 0,
  "total_chunks": 1,
  "text": "Melbourne Cricket Education Academy Community ScholarshipFor Melbourne Cricket Education Academy students undertaking the dual Diploma of Business and Diploma of Leadership and Management who love sport and can demonstrate circumstances impacting their education; worth 100% of tuition fees paid.Essendon Education Academy Community ScholarshipFor Essendon Education Academy students undertaking the dual Diploma of Business with the Diploma of Leadership and Management who love sport and can demonstrate circumstances impacting their education; worth 100% of tuition fees paid. Melbourne Cricket Education Academy Community ScholarshipFor Melbourne Cricket Education Academy students undertaking the dual Diploma of Business and Diploma of Leadership and Management who love sport and can demonstrate circumstances impacting their education; worth 100% of tuition fees paid. Melbourne Cricket Education Academy Community Scholarship For Melbourne Cricket Education Academy students undertaking the dual Diploma of Business and Diploma of Leadership and Management who love sport and can demonstrate circumstances impacting their education; worth 100% of tuition fees paid. Essendon Education Academy Community ScholarshipFor Essendon Education Academy students undertaking the dual Diploma of Business with the Diploma of Leadership and Management who love sport and can demonstrate circumstances impacting their education; worth 100% of tuition fees paid. Essendon Education Academy Community Scholarship For Essendon Education Academy students undertaking the dual Diploma of Business with the Diploma of Leadership and Management who love sport and can demonstrate circumstances impacting their education; worth 100% of tuition fees paid.",
  "structured_data": {
    "course_code": "C5406"
  },
  "metadata": {
    "start_char": null,
    "end_char": null,
    "category": "course-information"
  }
}