{
  "page_title": "Short courses and microcredentials",
  "page_url": "https://www.rmit.edu.au/study-with-us/short-courses",
  "page_index": 33,
  "chunk_index": 3,
  "total_chunks": 30,
  "text": "data, Data Engineers set the foundations, specialising in managing the critical infrastructure and architecture that organisations use to make decisions. Delivered to you in partnership with Udacity. Data Engineering with AWS As jobs continue to explode through the world of big data, Data Engineers set the foundations, specialising in managing the critical infrastructure and architecture that organisations use to make decisions. Delivered to you in partnership with Udacity. AutoCAD - Level 1Icon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.VOCATIONAL SHORT COURSE | Duration 32 hours | In person | NEXT INTAKE 1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course. Tailored for various industries, it combines theory, demonstration and hands-on practical exercises. AutoCAD - Level 1 Icon / Small / LocationCreated with Sketch.VOCATIONAL SHORT COURSE | Duration 32 hours | In person | NEXT INTAKE 1 September 2025 VOCATIONAL SHORT COURSE | Duration 32 hours | In person | NEXT INTAKE 1 September 2025 Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course. Tailored for various industries, it combines theory, demonstration and hands-on practical exercises. Deep LearningIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025Harness the power of neural networks to solve complex business problems and be part of the upcoming wave of deep learning experts shaping the future with AI. Delivered to you in partnership with Udacity. Deep Learning Harness the power of neural networks to solve complex business problems and be part of the upcoming wave of deep learning experts shaping the future with AI. Delivered to you in partnership with Udacity. AutoCAD - Level 2Icon / Small / CalendarCreated with Sketch.",
  "structured_data": {
    "career_outcomes": "as a front end web developer",
    "duration": "12 weeks",
    "intake": "1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course"
  },
  "metadata": {
    "start_char": 5118,
    "end_char": 7098,
    "category": "course-information"
  }
}