{
  "page_title": "RMIT University - Online Service Standards",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/rmit-university-online-service-standards",
  "page_index": 31,
  "chunk_index": 2,
  "total_chunks": 10,
  "text": "R includes a diagnostic language, literacy and numeracy (LLN) test to ascertain a student’s currentACSF level and to ensure the course is matched to their needs, and if additional support is required.As part of this enrolment process, students also complete a comprehensive questionnaire regarding any additional supports required due to a disability or long-term medical condition and to determine their digital literacy in relation to using the Canvas Learning Management System (LMS) and other digital technology/software.If anything is flagged as a part of this comprehensive process, a course coordinator will have a conversation with the student identified to discuss their support needs and suitability for the program.RMIT University uses the learning management system Canvas for supporting course delivery. The following are the minimum information technology requirements to enable optimal access to the LMS:A device with a minimum of 8GB memory and 2Ghz processorMicrosoft Windows 7 and above, Mac OSX version 10.6 and above and Linux - ChromeOS. RMIT conducts a comprehensive Pre-Training Review (PTR) as a part of enrolment for all prospective students. The purpose of this is to determine whether a course is suitable and appropriate for their individual needs, and if so, to flag additional support required to give a student the best chance of success in the program. This PTR includes a diagnostic language, literacy and numeracy (LLN) test to ascertain a student’s currentACSF level and to ensure the course is matched to their needs, and if additional support is required. As part of this enrolment process, students also complete a comprehensive questionnaire regarding any additional supports required due to a disability or long-term medical condition and to determine their digital literacy in relation to using the Canvas Learning Management System (LMS) and other digital technology/software.",
  "structured_data": {},
  "metadata": {
    "start_char": 3386,
    "end_char": 5304,
    "category": "course-information"
  }
}