{
  "page_title": "Pre-university study",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/victorian-certificate-of-education",
  "page_index": 26,
  "chunk_index": 0,
  "total_chunks": 2,
  "text": "RMIT ExtensionRMIT Extensions give you a head start at university by completing two undergraduate courses during the final year of your VCE.Tertiary PreparationRMIT's Certificate IV in Tertiary Preparation allows you to develop the academic skills, knowledge and confidence to study a university program.Foundation studiesFoundation Studies is a program designed for international students as a direct pathway to degree programs at RMIT University.English language courses for international studentsRMIT offers English for Academic Purposes language courses with RMIT English Worldwide that get students ready for university. They provide you with the right language skills to be able to undertake further study in an English learning environment. RMIT ExtensionRMIT Extensions give you a head start at university by completing two undergraduate courses during the final year of your VCE. RMIT Extension RMIT Extensions give you a head start at university by completing two undergraduate courses during the final year of your VCE. Tertiary PreparationRMIT's Certificate IV in Tertiary Preparation allows you to develop the academic skills, knowledge and confidence to study a university program. Tertiary Preparation RMIT's Certificate IV in Tertiary Preparation allows you to develop the academic skills, knowledge and confidence to study a university program. Foundation studiesFoundation Studies is a program designed for international students as a direct pathway to degree programs at RMIT University. Foundation studies Foundation Studies is a program designed for international students as a direct pathway to degree programs at RMIT University. English language courses for international studentsRMIT offers English for Academic Purposes language courses with RMIT English Worldwide that get students ready for university. They provide you with the right language skills to be able to undertake further study in an English learning environment.",
  "structured_data": {},
  "metadata": {
    "start_char": 0,
    "end_char": 1952,
    "category": "course-information"
  }
}