{
  "page_title": "RMIT University - Online Service Standards",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/rmit-university-online-service-standards",
  "page_index": 31,
  "chunk_index": 1,
  "total_chunks": 10,
  "text": "available via video conference. The library collections are electronically indexed and available completely online. Much of the library’s digital collections are available through the library website. The library’s digital collections available online include, but are not limited to:Databasese-JournalsVideo and audioImagesNewspapersStandardsThesesOpen Educational Resources (OER)Course reserve and past exam papersDictionaries and encyclopediasLaw and legislationPatentsIndigenous resources.Help is available during semester hours (Melbourne time)Monday to Friday: 9am-8pmWeekends: 12pm-5pmPublic holidays: closed.Library support is provided during semester hours in person, online or via web chat, justAsk the Library. The library collections are electronically indexed and available completely online. Much of the library’s digital collections are available through the library website. The library’s digital collections available online include, but are not limited to: Databases e-Journals Video and audio Images Newspapers Standards Theses Open Educational Resources (OER) Course reserve and past exam papers Dictionaries and encyclopedias Law and legislation Patents Indigenous resources. Help is available during semester hours (Melbourne time) Monday to Friday: 9am-8pm Weekends: 12pm-5pm Public holidays: closed. Library support is provided during semester hours in person, online or via web chat, justAsk the Library. RMIT conducts a comprehensive Pre-Training Review (PTR) as a part of enrolment for all prospective students. The purpose of this is to determine whether a course is suitable and appropriate for their individual needs, and if so, to flag additional support required to give a student the best chance of success in the program.This PTR includes a diagnostic language, literacy and numeracy (LLN) test to ascertain a student’s currentACSF level and to ensure the course is matched to their needs, and if additional support is required.",
  "structured_data": {},
  "metadata": {
    "start_char": 1624,
    "end_char": 3586,
    "category": "course-information"
  }
}