{
  "page_title": "Certificate IV in Training and Assessment - Plan C4436",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/certificates/certificate-iv-in-training-and-assessment-c4436/c4436auscy",
  "page_index": 193,
  "chunk_index": 1,
  "total_chunks": 6,
  "text": "dents to focus exclusively on their assessments.Please note:Days and times are subject to change. Always confirm with the Program Coordinator or refer to the official timetable for the latest updates.Online evening deliveryFor those unable to attend daytime classes, the program is also offered in an online delivery mode using Collaborate Ultra.This is scheduled over two evenings per week, totalling 7 hours of teacher-led instruction:- Evening 1: 5:00 PM – 8:30 PM- Evening 2: 5:00 PM – 8:30 PMThis flexible schedule accommodates learners who are working full-time or part-time while undertaking the program.As with the on-campus delivery, time is allocated within the 7-hour weekly schedule for students to focus on their assessment tasks, including one (1) hour with no new content delivered, dedicated to assessment work.Please note:Days and times are subject to change. Always confirm with the Program Coordinator or refer to the official timetable for the latest updates.C4436 Core CoursesStudents must complete a series of compulsory onboarding modules during their first semester or study period.",
  "structured_data": {
    "course_code": "C4436",
    "campus": "Assess competence (TAEASS412) | 50 | TCHE5952C | City Campus Participate in assessment validation (TAEASS413) | 50 | TCHE5953C | City Campus Facilitate vocational training (TAEDEL411) | 45 | TCHE5954C | City Campus Use nationally recognised training products to meet vocational training needs (TAEDES411) | 25 | TCHE5955C | City Campus Design and develop plans for vocational training (TAEDES412) | 60 | TCHE5956C | City Campus Work effectively in the VET sector (TAEPDD401) | 40 | TCHE5957C | City Campus Plan, organise and facilitate online learning (TAEDEL405) | 40 | TCHE5959C | City Campus Facilitate workplace-based learning (TAEDEL412) | 25 | TCHE5960C | City Campus Provide work skill instruction (TAEDEL311) | 40 | TCHE5961C | City Campus Assess competence in an online environment (TAEASS404) | 40 | TCHE5962C | City Campus Make Presentations (BSBCMM411) | 30 | COMM5469C | City Campus Use foundation skills resources, strategies and advice (TAELLN422) | 30 | TCHE5964C | City Campus This qualification requires the completion of 6 core courses and 6 courses from the elective course list"
  },
  "metadata": {
    "start_char": 1738,
    "end_char": 2844,
    "category": "course-information"
  }
}