{
  "page_title": "Foundation Studies",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/foundation-studies/foundation-studies-fs022",
  "page_index": 17,
  "chunk_index": 0,
  "total_chunks": 6,
  "text": "The curriculum is designed for overseas students and is comparable in standard to an Australian year 12 curriculum. Foundation Studies is delivered over two semesters. You will study four subjects per semester with 20 hours of scheduled study per week. The Foundations Studies curriculum encourages you to explore new ideas and consider your own place and purpose in an increasingly interconnected and interdependent world. Assessments are designed to connect learning with current real-world scenarios, and can be structured as written or oral, and as independent or group activities. Our learning activities promote engagement and are designed to build your confidence to think critically and creatively, to reason and to problem solve. These are highly valuable and transferable employability skills required in all career paths. During your studies, you will have access to: High quality teaching and learning – our teachers are friendly, and experienced in working with international students and understanding your needs Student support – our staff are here to help you. They will provide you with tailored advice, guidance, counselling, reassurance and support as soon as you start Academic support – providing tailored support and advice along your learning journey Social activities – we arrange student gatherings, city and campus tours and other events to help you explore Melbourne, meet other students and have fun! The knowledge and skills you will acquire throughout this course and how they can be applied in your career are described in the learning outcomes.",
  "structured_data": {
    "course_code": "FS022",
    "campus": "tours and other events to help you explore Melbourne, meet other students and have fun! The knowledge and skills you will acquire throughout this course and how they can be applied in your career are described in the learning outcomes"
  },
  "metadata": {
    "start_char": 0,
    "end_char": 1576,
    "category": "course-information"
  }
}