{
  "page_title": "Short courses and microcredentials",
  "page_url": "https://www.rmit.edu.au/study-with-us/short-courses",
  "page_index": 33,
  "chunk_index": 6,
  "total_chunks": 30,
  "text": "ramming fundamentals including HTML, CSS, Python, and JavaScript. Ignite your passion for practice and develop the curiosity to experiment with your code. Delivered to you in partnership with Udacity. Intro to Programming Learn programming fundamentals including HTML, CSS, Python, and JavaScript. Ignite your passion for practice and develop the curiosity to experiment with your code. Delivered to you in partnership with Udacity. Security AnalystIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025Dive deep into the fundamentals of information security. Learn to design security controls for networks, systems, and applications, while acquiring skills in threat mitigation and incident response. Delivered to you in partnership with Udacity. Security Analyst Dive deep into the fundamentals of information security. Learn to design security controls for networks, systems, and applications, while acquiring skills in threat mitigation and incident response. Delivered to you in partnership with Udacity. Security ArchitectIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025Transform threats into opportunities as you explore the essentials of security architecture. Learn to design and implement solutions that mitigate risk and protect critical data. Delivered to you in partnership with Udacity. Security Architect Transform threats into opportunities as you explore the essentials of security architecture. Learn to design and implement solutions that mitigate risk and protect critical data. Delivered to you in partnership with Udacity. Sustainability and climate-related financial reporting: ISSB, AASB and beyondIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.",
  "structured_data": {
    "career_outcomes": "as a front end web developer",
    "duration": "12 weeks",
    "intake": "1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course"
  },
  "metadata": {
    "start_char": 10242,
    "end_char": 12221,
    "category": "course-information"
  }
}