{
  "page_title": "Foundation Studies",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/foundation-studies/foundation-studies-fs022",
  "page_index": 17,
  "chunk_index": 2,
  "total_chunks": 6,
  "text": "ffered are subject to change. RMIT Foundation Studies is a standard streamed Foundation program. Students study four subjects each semester. Each stream consists of six core and two elective subjects. These include two English subjects,Exploring Narratives and Comparative Texts, plus four specialised discipline subjects. In each stream, students choose two electives from the options* provided. There are six streams to choose from: Art, Design and Architecture Business Communication and Social Context Engineering and Science Health Information Technology (IT) Please note, you must enrol in the correct Foundation Studies stream to allow you to meet the requirements of your chosen degree. *The number of elective options and courses offered are subject to change. The total indicative tuition fee for 2025 commencement is AU$29,350.View tuition fees for future years The total indicative tuition fee for 2025 commencement is AU$29,350. View tuition fees for future years If you are undertaking Foundation Studies Art, Design and Architecture stream, you are required to purchase the Art, Design and Architecture materials kit to complete required assessment tasks during your program.The cost of this material kit in 2025 is approximately AU$626.96. This includes a 20% discount.Art, Design and Architecture materials list (PDF)If you are undertaking any mathematics courses, you will be required to have a Ti-Nspire CX II CAS Graphing Calculator.This can be purchased fromOfficeworks. In 2025 the cost will be approximately AU$250.In addition to tuition fees you also need to pay for:Student services and amenities fee (SSAF) in each calendar year.Overseas Student Health Cover (OSHC)- Student visa holders must have cover for the total duration of their visa.Some programs incuradditional expenses.You also need to account for your living expenses. Estimate thecost of livingin Melbourne.",
  "structured_data": {
    "course_code": "FS022",
    "campus": "tours and other events to help you explore Melbourne, meet other students and have fun! The knowledge and skills you will acquire throughout this course and how they can be applied in your career are described in the learning outcomes"
  },
  "metadata": {
    "start_char": 3149,
    "end_char": 5045,
    "category": "course-information"
  }
}