{
  "page_title": "Foundation Studies - Plan FS022SIT",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/foundation-studies/foundation-studies-fs022/fs022sitauscy",
  "page_index": 24,
  "chunk_index": 1,
  "total_chunks": 4,
  "text": "ratives using appropriate communication technologies for specified audiences and functions.Students must complete a series of compulsory onboarding modules during their first semester or study period. Semester One: Complete the following Four (4) Courses:Course TitleCredit PointsCourse CodeCampusExploring Narratives12LANG1382City CampusGeneral Mathematics12MATH2433City CampusData Analytics12ISYS3452City CampusStatistics and Probability12MATH2424City CampusANDSemester Two: Complete the following Two (2) Courses:Course TitleCredit PointsCourse CodeCampusComparative Texts12LANG1376City CampusIntroduction to Software Development12COSC2965City CampusANDSelect and Complete Two (2) of the following Courses:Course TitleCredit PointsCourse CodeCampusAdvanced Mathematics12MATH2427City CampusPsychology12BESC1567City CampusMultimedia12COMM2882City CampusMedia: Power and Persuasion12COMM2885City Campus CRICOS code: 108492M To complete the program you must complete the following : All courses listed may not be available each semester.Year One of ProgramThe Information Technology stream introduces you to fundamental technology skills and asks students to investigate the practical, legal and ethical considerations of data collection and information sharing. You will be asked to create technological and creative solutions in order to solve a problem or communicate an idea. You will develop confidence in creating multimodal narratives using appropriate communication technologies for specified audiences and functions.Students must complete a series of compulsory onboarding modules during their first semester or study period.",
  "structured_data": {
    "course_code": "FS022",
    "campus": "Exploring Narratives | 12 | LANG1382 | City Campus General Mathematics | 12 | MATH2433 | City Campus Data Analytics | 12 | ISYS3452 | City Campus Statistics and Probability | 12 | MATH2424 | City Campus Comparative Texts | 12 | LANG1376 | City Campus Introduction to Software Development | 12 | COSC2965 | City Campus Advanced Mathematics | 12 | MATH2427 | City Campus Psychology | 12 | BESC1567 | City Campus Multimedia | 12 | COMM2882 | City Campus Media: Power and Persuasion | 12 | COMM2885 | City Campus CRICOS code: 108492MTo complete the program you must complete the following :  All courses listed may not be available each semester"
  },
  "metadata": {
    "start_char": 1090,
    "end_char": 2723,
    "category": "course-information"
  }
}