{
  "page_title": "Short courses and microcredentials",
  "page_url": "https://www.rmit.edu.au/study-with-us/short-courses",
  "page_index": 33,
  "chunk_index": 16,
  "total_chunks": 30,
  "text": "in describing it. The course is designed to prepare candidates for the CELTA course but is open to all proficient users of English who are interested in developing their understanding of its grammar. Product Management FundamentalsIcon / Small / CalendarCreated with Sketch.16 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 14 July 2025Create desirable, feasible and commercially viable digital products. Adopt a product-led approach for scalable solutions throughout the product lifecycle, enhancing business outcomes. Product Management Fundamentals Create desirable, feasible and commercially viable digital products. Adopt a product-led approach for scalable solutions throughout the product lifecycle, enhancing business outcomes. Project Management for ProfessionalsIcon / Small / CalendarCreated with Sketch.16 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 16 June 2025Manage complex projects and evolving systems of work by developing essential project management and human skills that enable you to confidently motivate, communicate and deliver business outcomes. Project Management for Professionals Manage complex projects and evolving systems of work by developing essential project management and human skills that enable you to confidently motivate, communicate and deliver business outcomes. Revit Architecture – Level 1Icon / Small / CalendarCreated with Sketch.18 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.VOCATIONAL SHORT COURSE | Duration 24 hours | In person | NEXT INTAKE 30 June 2025Build experience with Revit Architecture, a robust 2D/3D modelling tool. Using theory, demos and practical exercises, this course offers a foundation in modelling commands and software capabilities. Revit Architecture – Level 1 Icon / Small / CalendarCreated with Sketch.",
  "structured_data": {
    "career_outcomes": "as a front end web developer",
    "duration": "12 weeks",
    "intake": "1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course"
  },
  "metadata": {
    "start_char": 27698,
    "end_char": 29635,
    "category": "course-information"
  }
}