{
  "page_title": "Foundation Studies - Plan FS022COM",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/foundation-studies/foundation-studies-fs022/fs022comauscy",
  "page_index": 21,
  "chunk_index": 2,
  "total_chunks": 4,
  "text": "a variety of formats including essays, oral presentations, debates and multimedia formats.Students must complete a series of compulsory onboarding modules during their first semester or study period. Semester One: Complete the following Four (4) Courses:Course TitleCredit PointsCourse CodeCampusExploring Narratives12LANG1382City CampusGlobal Studies: Relationships and Trade12POLI1116City CampusLaw and Society12LAW2616City CampusMedia: Power and Persuasion12COMM2885City CampusANDSemester Two: Complete the following Two (2) Courses:Course TitleCredit PointsCourse CodeCampusComparative Texts12LANG1376City CampusCreative Narratives12LANG1379City CampusANDSelect and Complete Two (2) of the following Courses:Course TitleCredit PointsCourse CodeCampusData Analytics12ISYS3452City CampusMarketing and Communication12MKTG1491City CampusPsychology12BESC1567City CampusMultimedia12COMM2882City Campus To complete the program you must complete the following : All courses listed may not be available each semester. Year One of Program This stream investigates views, behaviours and relationships which operate in society. Media, Global Studies and Creative Narratives develop your understanding of power and influence that affect your daily life influencing your thinking and shaping your opinionThe use of thinking tools will generate a deeper analysis of situations and assist the development of responses. You will be asked to respond in a variety of formats including essays, oral presentations, debates and multimedia formats. This stream investigates views, behaviours and relationships which operate in society. Media, Global Studies and Creative Narratives develop your understanding of power and influence that affect your daily life influencing your thinking and shaping your opinion The use of thinking tools will generate a deeper analysis of situations and assist the development of responses.",
  "structured_data": {
    "course_code": "FS022",
    "campus": "Exploring Narratives | 12 | LANG1382 | City Campus Global Studies: Relationships and Trade | 12 | POLI1116 | City Campus Law and Society | 12 | LAW2616 | City Campus Media: Power and Persuasion | 12 | COMM2885 | City Campus Comparative Texts | 12 | LANG1376 | City Campus Creative Narratives | 12 | LANG1379 | City Campus Data Analytics | 12 | ISYS3452 | City Campus Marketing and Communication | 12 | MKTG1491 | City Campus Psychology | 12 | BESC1567 | City Campus Multimedia | 12 | COMM2882 | City Campus CRICOS code: 108492MTo complete the program you must complete the following :  All courses listed may not be available each semester"
  },
  "metadata": {
    "start_char": 2573,
    "end_char": 4478,
    "category": "course-information"
  }
}