{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 16,
  "chunk_index": 12,
  "total_chunks": 15,
  "text": "stimate thecost of livingin Melbourne.You do not need to pay theStudent Services and Amenities fee (SSAF)for the EAP program. The SSAF fee applies to other RMIT programs, including Foundation Studies.If you request a replacement certificate or statement for your English for Academic Purposes program, this will incur additional charges.Replacment documentFeeEnglish for Academic Purposes replacement Statement of AttendanceAU$10English for Academic Purposes replacement Statement of Course Results (final results for one level studied)AU$10English for Academic Purposes replacement completed set of Statement of Course Results (final results for each level studied)AU$20 In addition to tuition fees you also need to pay forOverseas Student Health Cover (OSHC).Student visa holders must have cover for the total duration of their visa.You also need to account for your living expenses. Estimate thecost of livingin Melbourne. In addition to tuition fees you also need to pay forOverseas Student Health Cover (OSHC).Student visa holders must have cover for the total duration of their visa. Student visa holders must have cover for the total duration of their visa. You also need to account for your living expenses. Estimate thecost of livingin Melbourne. You also need to account for your living expenses. Estimate the in Melbourne. You do not need to pay theStudent Services and Amenities fee (SSAF)for the EAP program. The SSAF fee applies to other RMIT programs, including Foundation Studies. If you request a replacement certificate or statement for your English for Academic Purposes program, this will incur additional charges.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 19500,
    "end_char": 21134,
    "category": "course-information"
  }
}