{
  "page_title": "RMIT University - Online Service Standards",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/rmit-university-online-service-standards",
  "page_index": 31,
  "chunk_index": 5,
  "total_chunks": 10,
  "text": "s and feedback.The learning materials used in online training are interactive and in a variety of formats, including:guided contentgraphicsvideoaudiointeraction through discussion forums and webinars. Canvasis RMIT's online Learning Management System (LMS), where students can find course announcements and content, including class notes and resources. On Canvas students can listen to lectures, complete online assessment tasks, view and submit assignments, and receive grades and feedback. The learning materials used in online training are interactive and in a variety of formats, including: guided content graphics video audio interaction through discussion forums and webinars. RMIT is committed to ensuring its online delivery meets universal accessibility standards. As part of its Digital Accessibility Framework, it aims to achieveWCAG 2.1 AA standardfor all online environments and digital material whenever possible.RMIT applies the principles of the Web Content Accessibility Guidelines to the learning materials by making them perceivable, operable, understandable, and robust.Perceivable:This principle ensures that web content is presented in a way that users can perceive it. This includes providing text alternatives for non-text content, providing captions and audio descriptions for multimedia content, and making sure that content is easily distinguishable from its background.Operable:This principle ensures that web content is operable by users. This includes providing clear and consistent navigation, ensuring that all functionality is available from a keyboard, and providing enough time for users to read and use the content.Understandable:This principle ensures that web content is understandable by users. This includes using clear and simple language, providing instructions and feedback in a clear and understandable way, and organising content in a logical and consistent manner.",
  "structured_data": {},
  "metadata": {
    "start_char": 8550,
    "end_char": 10460,
    "category": "course-information"
  }
}