{
  "page_title": "Certificate IV in Training and Assessment - Plan C4436FST",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/certificates/certificate-iv-in-training-and-assessment-c4436/c4436fstauscy",
  "page_index": 194,
  "chunk_index": 5,
  "total_chunks": 7,
  "text": "mely feedback from assessors in a structured environment. Time Commitment This fast-track program requires a significant time commitment, including: 20 evening online learning sessions(over 10 weeks). 17 full days of on-campus assessment observation(over eight weeks). Active participation in both components is essential to successfully complete the qualification. C4436FST Core Courses Students must complete a series of compulsory onboarding modules during their first semester or study period. Complete all six (6) courses:Course TitleNominal HoursCourse CodeCampusAssess competence (TAEASS412)50TCHE5952CCity CampusParticipate in assessment validation (TAEASS413)50TCHE5953CCity CampusFacilitate vocational training (TAEDEL411)45TCHE5954CCity CampusUse nationally recognised training products to meet vocational training needs (TAEDES411)25TCHE5955CCity CampusDesign and develop plans for vocational training (TAEDES412)60TCHE5956CCity CampusWork effectively in the VET sector (TAEPDD401)40TCHE5957CCity Campus Assess competence (TAEASS412) TCHE5952C City Campus Participate in assessment validation (TAEASS413) TCHE5953C Facilitate vocational training (TAEDEL411) TCHE5954C Use nationally recognised training products to meet vocational training needs (TAEDES411) TCHE5955C Design and develop plans for vocational training (TAEDES412) TCHE5956C Work effectively in the VET sector (TAEPDD401) TCHE5957C C4436FST Elective Course List Complete all six (6) courses:Course TitleNominal HoursCourse CodeCampusPlan, organise and facilitate online learning (TAEDEL405)40TCHE5959CCity CampusFacilitate workplace-based learning (TAEDEL412)25TCHE5960CCity CampusProvide work skill instruction (TAEDEL311)40TCHE5961CCity CampusAssess competence in an online environment (TAEASS404)40TCHE5962CCity CampusMake Presentations (BSBCMM411)30COMM5469CCity CampusUse foundation skills resources, strategies and advice (TAELLN422)30TCHE5964CCity Campus Plan, organise and facilitate online learning (TAEDEL405) TCHE",
  "structured_data": {
    "course_code": "C4436",
    "campus": "Assess competence (TAEASS412) | 50 | TCHE5952C | City Campus Participate in assessment validation (TAEASS413) | 50 | TCHE5953C | City Campus Facilitate vocational training (TAEDEL411) | 45 | TCHE5954C | City Campus Use nationally recognised training products to meet vocational training needs (TAEDES411) | 25 | TCHE5955C | City Campus Design and develop plans for vocational training (TAEDES412) | 60 | TCHE5956C | City Campus Work effectively in the VET sector (TAEPDD401) | 40 | TCHE5957C | City Campus Plan, organise and facilitate online learning (TAEDEL405) | 40 | TCHE5959C | City Campus Facilitate workplace-based learning (TAEDEL412) | 25 | TCHE5960C | City Campus Provide work skill instruction (TAEDEL311) | 40 | TCHE5961C | City Campus Assess competence in an online environment (TAEASS404) | 40 | TCHE5962C | City Campus Make Presentations (BSBCMM411) | 30 | COMM5469C | City Campus Use foundation skills resources, strategies and advice (TAELLN422) | 30 | TCHE5964C | City Campus This qualification requires the completion of 6 core courses and 6 courses from the elective course list"
  },
  "metadata": {
    "start_char": 8472,
    "end_char": 10472,
    "category": "course-information"
  }
}