{
  "page_title": "Course Information",
  "page_url": "https://www.rmit.edu.au/study-with-us",
  "page_index": 0,
  "chunk_index": 4,
  "total_chunks": 6,
  "text": "World University Rankings by Subject 2022 Social and community Make a positive impact in a field with fulfilling career options in politics and policy, languages, social and community work, and more. *QS World University Rankings by Subject 2022 VTAC Course Information & ApplicationsWhether you’re a current Year 12 student planning your next steps after high school or a non-Year 12 applicant returning to study, learn how to navigate the application process with the Victorian Tertiary Admissions Centre (VTAC), the central hub for tertiary course applications in Victoria.School Leaver HubWe’re here to help and guide you through your journey from high school to RMIT, so you can prepare what's next for you. VTAC Course Information & ApplicationsWhether you’re a current Year 12 student planning your next steps after high school or a non-Year 12 applicant returning to study, learn how to navigate the application process with the Victorian Tertiary Admissions Centre (VTAC), the central hub for tertiary course applications in Victoria. VTAC Course Information & Applications Whether you’re a current Year 12 student planning your next steps after high school or a non-Year 12 applicant returning to study, learn how to navigate the application process with the Victorian Tertiary Admissions Centre (VTAC), the central hub for tertiary course applications in Victoria. School Leaver HubWe’re here to help and guide you through your journey from high school to RMIT, so you can prepare what's next for you. School Leaver Hub We’re here to help and guide you through your journey from high school to RMIT, so you can prepare what's next for you. Find an agent in your country Information for Parents & GuardiansIs your teen preparing for their first year of uni, or interested in vocational education (sometimes known as TAFE)? Here's everything you need to know.",
  "structured_data": {
    "career_outcomes": "with a postgraduate qualification"
  },
  "metadata": {
    "start_char": 6908,
    "end_char": 8777,
    "category": "course-information"
  }
}