{
  "page_title": "RMIT University - Online Service Standards",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/rmit-university-online-service-standards",
  "page_index": 31,
  "chunk_index": 9,
  "total_chunks": 10,
  "text": "assessors to deliver real world learning experiences.Trainers and assessors undertake internal professional development in blended and online delivery based on RMIT Capability Framework for Educators.In addition, trainers and assessors also participate in:the RMIT teaching and learning conferenceannual college teaching and learning best practice showcasetailored Industry Cluster (department) professional development days, where trainers and assessors meet and share ideas on engaging teaching technologies, and best practice teaching methodologies.RMIT is anAdobe Creative Campus, supporting digital fluency and creativity across the University. Staff and students are provided access to Adobe applications, tools, expertise, and courses to develop their digital literacy skills in creative technology and digital innovation. All trainers and assessors delivering online or blended programs at RMIT hold a minimum qualification of Certificate IV Training and Assessment and remain current in their industry or field of expertise. This enables trainers and assessors to deliver real world learning experiences. Trainers and assessors undertake internal professional development in blended and online delivery based on RMIT Capability Framework for Educators. In addition, trainers and assessors also participate in: the RMIT teaching and learning conference annual college teaching and learning best practice showcase tailored Industry Cluster (department) professional development days, where trainers and assessors meet and share ideas on engaging teaching technologies, and best practice teaching methodologies. RMIT is anAdobe Creative Campus, supporting digital fluency and creativity across the University. Staff and students are provided access to Adobe applications, tools, expertise, and courses to develop their digital literacy skills in creative technology and digital innovation.",
  "structured_data": {},
  "metadata": {
    "start_char": 15380,
    "end_char": 17275,
    "category": "course-information"
  }
}