{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 16,
  "chunk_index": 6,
  "total_chunks": 15,
  "text": "oups and independently to complete class activities and tasks.Classes are delivered in person and/or online.AssessmentsYou must complete all the following assessments to complete English Intermediate.SkillAssessment TaskGrammar and VocabularyOnline testsReadingExaminationListeningExaminationWritingMid-course and final examinationSpeakingExaminationLearning outcomesReadingUnderstand the main points, details and conclusions in texts presenting a clear point of viewFollow an extended sequence of clear instructionsScan to locate information in textsListeningUnderstand instructions and proceduresFollow a talk containing a description, narrative or opinionUnderstand the main points in a discussion or interviewWritingWrite a short essay presenting a description or comparisonWrite a brief report and describe a simple processWrite a description or narrative based on experiences and feelingsSpeakingGive a prepared presentation to an audienceGive a sequence of instructions or describe a processParticipate in conversations, expressing opinions, attitudes and feelings Learn grammar and vocabulary to use in study and in everyday life.What you will learnYou will write structured paragraphs and essays and describe graphs. You will practise reading and listening to news and other texts and you will express your opinions on a range of topics, supporting your ideas with reasons.DeliveryYou will work in pairs, small groups and independently to complete class activities and tasks.Classes are delivered in person and/or online.AssessmentsYou must complete all the following assessments to complete English Intermediate. Learn grammar and vocabulary to use in study and in everyday life. You will write structured paragraphs and essays and describe graphs. You will practise reading and listening to news and other texts and you will express your opinions on a range of topics, supporting your ideas with reasons. You must complete all the following assessments to complete English Intermediate.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 10660,
    "end_char": 12657,
    "category": "course-information"
  }
}