{
  "page_title": "Study English Language at RMIT",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language",
  "page_index": 15,
  "chunk_index": 0,
  "total_chunks": 2,
  "text": "IELTSIELTS (International English Language Testing System) is the most popular English language test for tertiary education, work and migration purposes.PTEPTE Academic is the world’s leading computer-based test of English for study abroad and immigration. PTE Academic is the English test trusted by universities, colleges and governments around the world.IELTS One Skill RetakeWith IELTS One Skill Retake, you have the option to retake any one of the four skills (Listening, Reading, Writing, or Speaking) if you need to improve on one area. IELTSIELTS (International English Language Testing System) is the most popular English language test for tertiary education, work and migration purposes. IELTS IELTS (International English Language Testing System) is the most popular English language test for tertiary education, work and migration purposes. PTEPTE Academic is the world’s leading computer-based test of English for study abroad and immigration. PTE Academic is the English test trusted by universities, colleges and governments around the world. PTE Academic is the world’s leading computer-based test of English for study abroad and immigration. PTE Academic is the English test trusted by universities, colleges and governments around the world. IELTS One Skill RetakeWith IELTS One Skill Retake, you have the option to retake any one of the four skills (Listening, Reading, Writing, or Speaking) if you need to improve on one area. IELTS One Skill Retake With IELTS One Skill Retake, you have the option to retake any one of the four skills (Listening, Reading, Writing, or Speaking) if you need to improve on one area. CELTA - Certificate in Teaching English to Speakers of Other LanguagesThe most widely recognised pre-service qualification in the world for teachers of English to speakers of other languages.Grammar FundamentalsThese workshops help you prepare for the CELTA course but can help proficient English users develop their understanding of its grammar.",
  "structured_data": {},
  "metadata": {
    "start_char": 0,
    "end_char": 1981,
    "category": "course-information"
  }
}