{
  "page_title": "Application dates",
  "page_url": "https://www.rmit.edu.au/study-with-us/applying-to-rmit/local-student-applications/application-dates",
  "page_index": 1,
  "chunk_index": 2,
  "total_chunks": 5,
  "text": "course pages. Applications will open from 11 March 2025. **Some vocational courses, plus online and HDR courses are offered on a continuous basis. Information is available on individual course pages. Applications will be accepted for each program until all places are filled, so ensure you apply as early as possible for your application to be considered. Late applications may result in a delayed class commencement.The following programs have timely close dates that you will need to submit your application by*:*Late applications may continue to be accepted after these dates if places are still available. Applications will be accepted for each program until all places are filled, so ensure you apply as early as possible for your application to be considered. Late applications may result in a delayed class commencement. The following programs have timely close dates that you will need to submit your application by*: *Late applications may continue to be accepted after these dates if places are still available. Timely close dateCourse12 JuneAdvanced Diploma of Engineering Technology (Civil)13 JuneDiploma of Dental TechnologyDiploma of Nursing11 JulyCertificate IV in Cyber SecurityDiploma of Information Technology (Cyber Security)Diploma of Conservation and Ecosystem Management 12 June Advanced Diploma of Engineering Technology (Civil) 13 June Diploma of Dental TechnologyDiploma of Nursing Diploma of Dental Technology Diploma of Nursing 11 July Certificate IV in Cyber SecurityDiploma of Information Technology (Cyber Security)Diploma of Conservation and Ecosystem Management Certificate IV in Cyber Security Diploma of Information Technology (Cyber Security) Diploma of Conservation and Ecosystem Management Timely close dateCourse31 MayBachelor of Architectural Design 31 May Bachelor of Architectural Design Timely close dateCourse31 MayMaster of Architecture Master of Architecture Semester 1 intakeApplications open on 28 July 2025.",
  "structured_data": {
    "intake": "for which you can submit a direct application to RMIT"
  },
  "metadata": {
    "start_char": 3133,
    "end_char": 5089,
    "category": "course-information"
  }
}