{
  "page_title": "Application dates",
  "page_url": "https://www.rmit.edu.au/study-with-us/applying-to-rmit/local-student-applications/application-dates",
  "page_index": 1,
  "chunk_index": 0,
  "total_chunks": 5,
  "text": "Timely close date | Course 12 June | Advanced Diploma of Engineering Technology (Civil) 13 June | Diploma of Dental TechnologyDiploma of Nursing 11 July | Certificate IV in Cyber SecurityDiploma of Information Technology (Cyber Security)Diploma of Conservation and Ecosystem Management 31 May | Bachelor of Architectural Design 31 May | Master of Architecture TBC | TBC Looking for international student application dates?Application dates for international students Looking for international student application dates? Application dates for international students Learn key dates for submitting your application to study with us, either via VTAC or direct to RMIT. Each year, there are two intakes for which you can submit a direct application to RMIT. To find out whether you can submit an application Direct to RMIT, click the ‘Apply’ button on the relevantcourse page. Expand all sectionsCollapse all sections Expand all sections Collapse all sections Semester 2 (midyear) intakeApplications will open from 11 March 2025.**Some vocational courses, plus online and HDR courses are offered on a continuous basis. Information is available on individual course pages.Applications will be accepted for each program until all places are filled, so ensure you apply as early as possible for your application to be considered. Late applications may result in a delayed class commencement.The following programs have timely close dates that you will need to submit your application by*:*Late applications may continue to be accepted after these dates if places are still available.",
  "structured_data": {
    "intake": "for which you can submit a direct application to RMIT"
  },
  "metadata": {
    "start_char": 0,
    "end_char": 1576,
    "category": "course-information"
  }
}