{
  "page_title": "Vocational study",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study",
  "page_index": 20,
  "chunk_index": 1,
  "total_chunks": 2,
  "text": "ourse and save you money.Fee finderSo you’ve picked the course you want to study but want to find out how much you’ll pay to get started? Get an estimate of fees for your vocational education program.Fee assistanceAustralia’s VET Student Loans and Higher Education Loan Program (HELP) provides loans to students studying approved courses. They allow students to defer the costs of tuition until their taxable income reaches a certain level. Credit and recognitionRMIT recognises prior learning, so if you want to improve your current knowledge or skill level, you don’t necessarily have to start at certificate to finally walk away with an advanced diploma. Being acknowledged for previous study may reduce the duration of your course and save you money. Credit and recognition RMIT recognises prior learning, so if you want to improve your current knowledge or skill level, you don’t necessarily have to start at certificate to finally walk away with an advanced diploma. Being acknowledged for previous study may reduce the duration of your course and save you money. Fee finderSo you’ve picked the course you want to study but want to find out how much you’ll pay to get started? Get an estimate of fees for your vocational education program. Fee finder So you’ve picked the course you want to study but want to find out how much you’ll pay to get started? Get an estimate of fees for your vocational education program. Fee assistanceAustralia’s VET Student Loans and Higher Education Loan Program (HELP) provides loans to students studying approved courses. They allow students to defer the costs of tuition until their taxable income reaches a certain level. Fee assistance Australia’s VET Student Loans and Higher Education Loan Program (HELP) provides loans to students studying approved courses. They allow students to defer the costs of tuition until their taxable income reaches a certain level.",
  "structured_data": {},
  "metadata": {
    "start_char": 1762,
    "end_char": 3667,
    "category": "quick-course-scan"
  }
}