{
  "page_title": "Courses for international students",
  "page_url": "https://www.rmit.edu.au/study-with-us/international-students/programs-for-international-students",
  "page_index": 4,
  "chunk_index": 1,
  "total_chunks": 2,
  "text": "ntext), that align with your study goals and interests. Foundation studies RMIT Foundation Studies is your direct pathway to RMIT degree courses, giving you the skills you need to be university ready. Choose from study streams (covering art, design and architecture, business, engineering and science, health, information technology and communication and social context), that align with your study goals and interests. Vocational educationGain the practical skills you need for excellent job prospects and credits towards RMIT Univesity degrees. Vocational education Gain the practical skills you need for excellent job prospects and credits towards RMIT Univesity degrees. Undergraduate studyRMIT offers a range of bachelor, associate and honours degrees. Find the right undergraduate program for you. Undergraduate study RMIT offers a range of bachelor, associate and honours degrees. Find the right undergraduate program for you. Postgraduate studyRMIT's flexible postgraduate study options include graduate certificates, graduates diplomas and masters degrees. Postgraduate study RMIT's flexible postgraduate study options include graduate certificates, graduates diplomas and masters degrees. How to applyLearn how to apply to RMIT as an international student relocating to Australia. How to apply Learn how to apply to RMIT as an international student relocating to Australia. Intakes in Australia and key academic dates Prepare to arriveAll the things you will need to get organised before starting life as an international student at RMIT. Prepare to arrive All the things you will need to get organised before starting life as an international student at RMIT. Extra support for international students Find an Education AgentExplore our network of authorised education agents to assist you with course and application queries. Find an Education Agent Explore our network of authorised education agents to assist you with course and application queries. RMIT皇家墨尔本理工大学中国",
  "structured_data": {
    "intake": "in Australia and key academic dates Prepare to arriveAll the things you will need to get organised before starting life as an international student at RMIT"
  },
  "metadata": {
    "start_char": 1714,
    "end_char": 3692,
    "category": "quick-course-scan"
  }
}