{
  "page_title": "RMIT University - Online Service Standards",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/rmit-university-online-service-standards",
  "page_index": 24,
  "chunk_index": 7,
  "total_chunks": 10,
  "text": "that all functionality is available from a keyboard, and providing enough time for users to read and use the content. Understandable:This principle ensures that web content is understandable by users. This includes using clear and simple language, providing instructions and feedback in a clear and understandable way, and organising content in a logical and consistent manner. Robust:This principle ensures that web content is robust enough to be interpreted by a wide variety of user agents, including assistive technologies. This includes using standard coding practices, providing semantic markup, and using technology that is widely supported. Canvas is designed so that screen reader users can confidently utilise their preferred screen reader and browser. Where students may require additional support with online material, they may request assistance through their teaching team or theEquitable Learning Services (ELS).The ELS provides support and equal opportunities for students with a disability, long-term illness and/or mental health condition and primary carers of individuals with a disability. RMIT offers an engaging and interactive learning experience and provides collaborative learning opportunities for students to interact with peers through;In-class and online discussion forumsWebinarsCase studiesRole PlaySimulationsPractical industry experiences.Ongoing feedback will be given by trainers and assessors through discussion forums and online messaging, in response to individual student queries and through detailed feedback on assessments. RMIT offers an engaging and interactive learning experience and provides collaborative learning opportunities for students to interact with peers through; In-class and online discussion forums Webinars Case studies Role Play Simulations Practical industry experiences.",
  "structured_data": {},
  "metadata": {
    "start_char": 12045,
    "end_char": 13878,
    "category": "quick-course-scan"
  }
}