{
  "page_title": "Introduction to Translating and Interpreting Skill Set",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/skill-sets/introduction-to-translating-and-interpreting-skill-set-s0174",
  "page_index": 27,
  "chunk_index": 5,
  "total_chunks": 8,
  "text": "s displayed by the fee finder are indicative only and subject to change given individual circumstances at enrolment. Fees are adjusted on an annual basis and these fees should only be used as a guide. Student services and amenities fee (SSAF): AU$365 maximum fee* for 2025.*Note: *SSAF will be charged per nominal hour at a rate of $0.51 per hour.Other items related to your program, including field trips, textbooks and equipment. Student services and amenities fee (SSAF): AU$365 maximum fee* for 2025.*Note: *SSAF will be charged per nominal hour at a rate of $0.51 per hour. Other items related to your program, including field trips, textbooks and equipment. The student tuition fees as displayed by the fee finder are indicative only and subject to change given individual circumstances at enrolment. Fees are adjusted on an annual basis and these fees should only be used as a guide. In addition to tuition fees, you will be charged an annualstudent services and amenities fee (SSAF), which is used to maintain and enhance services and amenities that improve your experience as an RMIT student. The SSAF is calculated based on your enrolment load and the maximum fee for 2025 is $365. Note: SSAF will be charged per nominal hour at a rate of $0.51 per hour in 2025. You may also be required to purchase other items related to your program, including field trips, textbooks and equipment. Theseadditional fees and expensesvary from program to program. The annual tuition fee for 2022 is AU$XX,XXX.The total indicative tuition fee for 2022 commencement is AU$XX,XXX.View tuition fees for future years The annual tuition fee for 2022 is AU$XX,XXX.The total indicative tuition fee for 2022 commencement is AU$XX,XXX. The annual tuition fee for 2022 is AU$XX,XXX. The total indicative tuition fee for 2022 commencement is AU$XX,XXX. View tuition fees for future years In addition to tuition fees you also need to pay for:Student services and amenities fee (SSAF) in each calendar year.",
  "structured_data": {
    "course_code": "S0174",
    "campus": "classes"
  },
  "metadata": {
    "start_char": 8715,
    "end_char": 10702,
    "category": "quick-course-scan"
  }
}