{
  "page_title": "Application dates",
  "page_url": "https://www.rmit.edu.au/study-with-us/applying-to-rmit/local-student-applications/application-dates",
  "page_index": 1,
  "chunk_index": 4,
  "total_chunks": 5,
  "text": "ted after these dates if places are still available: Applications open on 28 July 2025. The following programs have timely close dates that you will need to submit your application by the below dates. Late applications may continue to be accepted after these dates if places are still available: Timely close dateCourseTBCTBC The Victorian Tertiary Admissions Centre (VTAC) administers the application process for universities (and other tertiary institutions) in Victoria.Click the ‘Apply’ button on the relevantcourse pageto see if you are required to apply through VTAC.Applications through VTACare open from 28 July 2025.Successful applicants will start their study from March 2026.Please refer to the VTAC site forimportant application and offer dates.Applications for semester 2 (midyear) are only available direct to RMIT. The Victorian Tertiary Admissions Centre (VTAC) administers the application process for universities (and other tertiary institutions) in Victoria.Click the ‘Apply’ button on the relevantcourse pageto see if you are required to apply through VTAC. The Victorian Tertiary Admissions Centre (VTAC) administers the application process for universities (and other tertiary institutions) in Victoria. Click the ‘Apply’ button on the relevantcourse pageto see if you are required to apply through VTAC. Applications through VTACare open from 28 July 2025.Successful applicants will start their study from March 2026.Please refer to the VTAC site forimportant application and offer dates. Applications through VTACare open from 28 July 2025. Successful applicants will start their study from March 2026. Please refer to the VTAC site forimportant application and offer dates. Applications for semester 2 (midyear) are only available direct to RMIT.",
  "structured_data": {
    "intake": "for which you can submit a direct application to RMIT"
  },
  "metadata": {
    "start_char": 6571,
    "end_char": 8342,
    "category": "quick-course-scan"
  }
}