{
  "page_title": "RMIT University - Online Service Standards",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/rmit-university-online-service-standards",
  "page_index": 24,
  "chunk_index": 6,
  "total_chunks": 10,
  "text": "nderstandable by users. This includes using clear and simple language, providing instructions and feedback in a clear and understandable way, and organising content in a logical and consistent manner.Robust:This principle ensures that web content is robust enough to be interpreted by a wide variety of user agents, including assistive technologies. This includes using standard coding practices, providing semantic markup, and using technology that is widely supported. Canvas is designed so that screen reader users can confidently utilise their preferred screen reader and browser.Where students may require additional support with online material, they may request assistance through their teaching team or theEquitable Learning Services (ELS).The ELS provides support and equal opportunities for students with a disability, long-term illness and/or mental health condition and primary carers of individuals with a disability. RMIT is committed to ensuring its online delivery meets universal accessibility standards. As part of its Digital Accessibility Framework, it aims to achieveWCAG 2.1 AA standardfor all online environments and digital material whenever possible. RMIT applies the principles of the Web Content Accessibility Guidelines to the learning materials by making them perceivable, operable, understandable, and robust. Perceivable:This principle ensures that web content is presented in a way that users can perceive it. This includes providing text alternatives for non-text content, providing captions and audio descriptions for multimedia content, and making sure that content is easily distinguishable from its background. Operable:This principle ensures that web content is operable by users. This includes providing clear and consistent navigation, ensuring that all functionality is available from a keyboard, and providing enough time for users to read and use the content. Understandable:This principle ensures that web content is understandable by users.",
  "structured_data": {},
  "metadata": {
    "start_char": 10260,
    "end_char": 12245,
    "category": "quick-course-scan"
  }
}