{
  "page_title": "Short courses and microcredentials",
  "page_url": "https://www.rmit.edu.au/study-with-us/short-courses",
  "page_index": 30,
  "chunk_index": 9,
  "total_chunks": 30,
  "text": "ss analytics by familiarising yourself with Excel, and tell compelling stories through data visualisation with Tableau. Business Analytics and Visualisation Icon / Small / CalendarCreated with Sketch.02 Jan 2025 - 31 Dec 2025 02 Jan 2025 - 31 Dec 2025 Learn the foundations of business analytics by familiarising yourself with Excel, and tell compelling stories through data visualisation with Tableau. Business Analytics with SQL and PythonIcon / Small / CalendarCreated with Sketch.02 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 16 June 2025Acquire foundational skills in SQL and Python, delivering powerful analysis and predictions for your team or business. Business Analytics with SQL and Python Acquire foundational skills in SQL and Python, delivering powerful analysis and predictions for your team or business. Content and Social Media MarketingIcon / Small / CalendarCreated with Sketch.03 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 16 June 2025Amplify your brand awareness and engage your audience through effective content, and social media strategies and campaigns. Content and Social Media Marketing Icon / Small / CalendarCreated with Sketch.03 Jan 2025 - 31 Dec 2028 03 Jan 2025 - 31 Dec 2028 Amplify your brand awareness and engage your audience through effective content, and social media strategies and campaigns. Customer Experience Strategy and Design Cyber Security Risk and StrategyIcon / Small / CalendarCreated with Sketch.03 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 11 Aug 2025Prevent attacks, mitigate risk and get up to speed with best-practice cyber security governance. Cyber Security Risk and Strategy Icon / Small / LocationCreated with Sketch.",
  "structured_data": {
    "duration": "12 weeks",
    "intake": "1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course"
  },
  "metadata": {
    "start_char": 15506,
    "end_char": 17399,
    "category": "quick-course-scan"
  }
}