{
  "page_title": "Master of Engineering (Robotics and Mechatronics Engineering) - Apply",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/postgraduate-study/masters-by-coursework/master-of-engineering-robotics-and-mechatronics-engineering-mc256/apply-now",
  "page_index": 105,
  "chunk_index": 0,
  "total_chunks": 2,
  "text": "How to applyHelpful step-by-step how to apply guides, including everything you need to submit an application to RMIT - from entry requirements to the documentation you'll need to complete your application to selection tasks and more.FeesDiscover fee information for programs and courses at RMIT University, including full-fee and Commonwealth supported places for postgraduate students, FEE-HELP loans and payment options.ScholarshipsAchieve your study goals with a scholarship. Each year scholarships are awarded to thousands of new and continuing students across RMIT study areas. How to applyHelpful step-by-step how to apply guides, including everything you need to submit an application to RMIT - from entry requirements to the documentation you'll need to complete your application to selection tasks and more. How to apply Helpful step-by-step how to apply guides, including everything you need to submit an application to RMIT - from entry requirements to the documentation you'll need to complete your application to selection tasks and more. FeesDiscover fee information for programs and courses at RMIT University, including full-fee and Commonwealth supported places for postgraduate students, FEE-HELP loans and payment options. Discover fee information for programs and courses at RMIT University, including full-fee and Commonwealth supported places for postgraduate students, FEE-HELP loans and payment options. ScholarshipsAchieve your study goals with a scholarship. Each year scholarships are awarded to thousands of new and continuing students across RMIT study areas. Scholarships Achieve your study goals with a scholarship. Each year scholarships are awarded to thousands of new and continuing students across RMIT study areas. How to applyHelpful step-by-step how to apply guides, including everything you need to submit an application to RMIT - from entry requirements to the documentation you'll need to complete your application to selection tasks and more.",
  "structured_data": {
    "course_code": "MC256"
  },
  "metadata": {
    "start_char": 0,
    "end_char": 1984,
    "category": "quick-course-scan"
  }
}