{
  "page_title": "Short courses and microcredentials",
  "page_url": "https://www.rmit.edu.au/study-with-us/short-courses",
  "page_index": 30,
  "chunk_index": 2,
  "total_chunks": 30,
  "text": "etch.FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 16 June 2025Gain a comprehensive understanding of the AI technology stack, adapt your skills and learn to automate campaign optimisation with AI. You’ll also learn to enhance customer interactions using chatbots. Artificial Intelligence in Marketing Gain a comprehensive understanding of the AI technology stack, adapt your skills and learn to automate campaign optimisation with AI. You’ll also learn to enhance customer interactions using chatbots. Data ArchitectIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025Explore your potential in enterprise data architecture and redefine data management. From ERDs to cutting-edge database design, you’ll learn the skills to shape the data landscape. Delivered to you in partnership with Udacity. Data Architect Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025 FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025 Explore your potential in enterprise data architecture and redefine data management. From ERDs to cutting-edge database design, you’ll learn the skills to shape the data landscape. Delivered to you in partnership with Udacity. Data Engineering with AWSIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025As jobs continue to explode through the world of big data, Data Engineers set the foundations, specialising in managing the critical infrastructure and architecture that organisations use to make decisions. Delivered to you in partnership with Udacity.",
  "structured_data": {
    "duration": "12 weeks",
    "intake": "1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course"
  },
  "metadata": {
    "start_char": 3533,
    "end_char": 5318,
    "category": "quick-course-scan"
  }
}