{
  "page_title": "Degree Apprenticeships | RMIT Earn and Learn",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/apprenticeships-and-traineeships/degree-apprenticeships",
  "page_index": 7,
  "chunk_index": 0,
  "total_chunks": 1,
  "text": "Undergraduate degreesAn undergraduate degree is the first level of university study and can open the door to various career paths or further study.Diplomas and advanced diplomasGet the specialised knowledge you need to work in skilled or paraprofessional areas. These courses normally take one to two years of full-time study.Guaranteed PathwaysSecure your place in your dream bachelor degree by completing your vocational studies (otherwise known as TAFE) first and graduating with two internationally recognised RMIT qualifications. Undergraduate degreesAn undergraduate degree is the first level of university study and can open the door to various career paths or further study. Undergraduate degrees An undergraduate degree is the first level of university study and can open the door to various career paths or further study. Diplomas and advanced diplomasGet the specialised knowledge you need to work in skilled or paraprofessional areas. These courses normally take one to two years of full-time study. Diplomas and advanced diplomas Get the specialised knowledge you need to work in skilled or paraprofessional areas. These courses normally take one to two years of full-time study. Guaranteed PathwaysSecure your place in your dream bachelor degree by completing your vocational studies (otherwise known as TAFE) first and graduating with two internationally recognised RMIT qualifications. Guaranteed Pathways Secure your place in your dream bachelor degree by completing your vocational studies (otherwise known as TAFE) first and graduating with two internationally recognised RMIT qualifications.",
  "structured_data": {},
  "metadata": {
    "start_char": null,
    "end_char": null,
    "category": "quick-course-scan"
  }
}