{
  "page_title": "Introduction to Translating and Interpreting Skill Set",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/skill-sets/s0148",
  "page_index": 29,
  "chunk_index": 4,
  "total_chunks": 8,
  "text": "ofessional body can reduce the duration of your study by acknowledging your earlier, relevant experience.Credit and exemptions will be assessed consistent with the principles of theRMIT Credit Policy.Find out if you might be eligible Credit, recognition of prior learning, professional experience and accreditation from a professional body can reduce the duration of your study by acknowledging your earlier, relevant experience.Credit and exemptions will be assessed consistent with the principles of theRMIT Credit Policy. Credit, recognition of prior learning, professional experience and accreditation from a professional body can reduce the duration of your study by acknowledging your earlier, relevant experience. Credit and exemptions will be assessed consistent with the principles of theRMIT Credit Policy. Find out if you might be eligible Currently there are no formal or direct pathways to other qualifications.Graduates of this course may choose to continue their studies in, and may be eligible for credit towards, RMIT’sDiploma of Interpreting. Currently there are no formal or direct pathways to other qualifications. Graduates of this course may choose to continue their studies in, and may be eligible for credit towards, RMIT’sDiploma of Interpreting. This program is only offered as a full-fee program. 2025 full-fee place: AU$2,500* total *Fees shown are indicative only and subject to change given individual circumstances at the time of enrolment. Use ourfee finderto get an estimate of your fees for this program. Student services and amenities fee (SSAF): AU$365 maximum fee* for 2025.*Note: *SSAF will be charged per nominal hour at a rate of $0.51 per hour.Other items related to your program, including field trips, textbooks and equipment.The student tuition fees as displayed by the fee finder are indicative only and subject to change given individual circumstances at enrolment. Fees are adjusted on an annual basis and these fees should only be used as a guide.",
  "structured_data": {
    "course_code": "S0148",
    "campus": "classes"
  },
  "metadata": {
    "start_char": 6920,
    "end_char": 8915,
    "category": "quick-course-scan"
  }
}