{
  "page_title": "Find a course | Study at RMIT",
  "page_url": "https://www.rmit.edu.au/study-with-us",
  "page_index": 0,
  "chunk_index": 3,
  "total_chunks": 6,
  "text": ", medical science, complementary medicine and more. Health Find your place in the healthcare industry and choose from roles in mental health, nursing, medical science, complementary medicine and more. Information technologyFrom computer science to software engineering, studying IT will help you gain the essential knowledge and skills that you can apply in any industry. Information technology From computer science to software engineering, studying IT will help you gain the essential knowledge and skills that you can apply in any industry. LawBegin an impactful and international career in law with courses that cover justice and criminology, policy, and legal administration practice. Begin an impactful and international career in law with courses that cover justice and criminology, policy, and legal administration practice. MediaWhether you're interested in digital media, communication, journalism, music, audio or film, RMIT is at the forefront of media studies. Media Whether you're interested in digital media, communication, journalism, music, audio or film, RMIT is at the forefront of media studies. Property PsychologyExplore the mysteries of the mind with specialised clinical psychology courses based on a cognitive-behavioural approach. Psychology Explore the mysteries of the mind with specialised clinical psychology courses based on a cognitive-behavioural approach. ScienceFrom computer science to software engineering, studying IT will help you gain the essential knowledge and skills that you can apply in any industry. Science Social and communityMake a positive impact in a field with fulfilling career options in politics and policy, languages, social and community work, and more. *QS World University Rankings by Subject 2022 Social and community Make a positive impact in a field with fulfilling career options in politics and policy, languages, social and community work, and more.",
  "structured_data": {},
  "metadata": {
    "start_char": 5194,
    "end_char": 7108,
    "category": "quick-course-scan"
  }
}