{
  "page_title": "Short courses and microcredentials",
  "page_url": "https://www.rmit.edu.au/study-with-us/short-courses",
  "page_index": 30,
  "chunk_index": 5,
  "total_chunks": 30,
  "text": "s and impartiality. Delivered to you in partnership with Udacity. Front End Web DeveloperIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START Notify MeGain the tools, knowledge, and experience to make a variety of websites and applications and kickstart your career as a front end web developer. Delivered to you in partnership with Udacity. Front End Web Developer Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START Notify Me FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START Notify Me Gain the tools, knowledge, and experience to make a variety of websites and applications and kickstart your career as a front end web developer. Delivered to you in partnership with Udacity. Generative AI for Software DevelopersIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025Elevate your skills with Generative AI. Develop custom applications and explore the power of LLMs to stay at the forefront of AI and deep learning. Delivered to you in partnership with Udacity. Generative AI for Software Developers Elevate your skills with Generative AI. Develop custom applications and explore the power of LLMs to stay at the forefront of AI and deep learning. Delivered to you in partnership with Udacity. Implementing Digital Marketing Campaigns Intro to ProgrammingIcon / Small / CalendarCreated with Sketch.01 Jan 2025 - 31 Dec 2025Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 16 weeks | NEXT START 16 June 2025Learn programming fundamentals including HTML, CSS, Python, and JavaScript. Ignite your passion for practice and develop the curiosity to experiment with your code. Delivered to you in partnership with Udacity.",
  "structured_data": {
    "duration": "12 weeks",
    "intake": "1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course"
  },
  "metadata": {
    "start_char": 8529,
    "end_char": 10442,
    "category": "quick-course-scan"
  }
}