{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 15,
  "chunk_index": 4,
  "total_chunks": 15,
  "text": "ing and presentations throughout the course Learn English to communicate in everyday situations. Delivery You will work in pairs, small groups and independently to complete class activities and tasks. Classes are delivered in person and/or online. Assessments You must complete all the following assessments to complete English Elementary. SkillsAssessment taskGrammar and VocabularyOnline testsReadingMid-course and final examinationListeningMid-course and final examinationWritingMid-course and final examinationSpeakingSpeaking and presentations throughout the course Grammar and Vocabulary Online tests Reading Mid-course and final examination Listening Writing Speaking Speaking and presentations throughout the course Learning outcomesReadingUnderstand simple instructions and directionsScan for information in short textsUnderstand the main points in simple descriptive textsListeningUnderstand key points in a short descriptionIdentify data such as numbers, dates and pricesFollow short conversationsUnderstand the main points in informational or news reportsWritingWrite a series of sentences on a familiar topicComplete a form with personal informationWrite a descriptionSpeakingPrepare and give a short presentation on a familiar topicGive directions or instructionsParticipate in everyday transactionsAsk and answer simple questions on personal and familiar topics Learning outcomes Understand simple instructions and directions Scan for information in short texts Understand the main points in simple descriptive texts Understand key points in a short description Identify data such as numbers, dates and prices Follow short conversations Understand the main points in informational or news reports Write a series of sentences on a familiar topic Complete a form with personal information Write a description Prepare and give a short presentation on a familiar topic Give directions or instructions Participate in everyday transactions Ask and answer simple questions on personal and fam",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 7086,
    "end_char": 9086,
    "category": "quick-course-scan"
  }
}