{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 15,
  "chunk_index": 13,
  "total_chunks": 15,
  "text": "applies to other RMIT programs, including Foundation Studies. If you request a replacement certificate or statement for your English for Academic Purposes program, this will incur additional charges. Replacment documentFeeEnglish for Academic Purposes replacement Statement of AttendanceAU$10English for Academic Purposes replacement Statement of Course Results (final results for one level studied)AU$10English for Academic Purposes replacement completed set of Statement of Course Results (final results for each level studied)AU$20 English for Academic Purposes replacement Statement of Attendance AU$10 English for Academic Purposes replacement Statement of Course Results (final results for one level studied) English for Academic Purposes replacement completed set of Statement of Course Results (final results for each level studied) AU$20 RMIT awards more than 2000 scholarships every year to recognise academic achievement and assist students from a variety of backgrounds.Explore scholarships RMIT awards more than 2000 scholarships every year to recognise academic achievement and assist students from a variety of backgrounds. Explore scholarships Enrolment guide for RMIT English language students Enrolment Enrolment opens 2 weeks prior to the start of each module. New students will receive an email from Student Services with: The enrolment form – complete the form to enrol Orientation is compulsory for all new English for Academic Purposes students. It takes place on the Friday before the start of each module. The orientation program covers: Wellbeing: Find out how to access confidential support services available to guide you through your studies. Need help? The length of your English Language Pathways program will be determined by your current level of English, the level of English you wish to reach, and how well you progress. English Language Pathways at RMIT UP is delivered in 5-week modules. Each level is delivered over two 5-week modules.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 20934,
    "end_char": 22908,
    "category": "quick-course-scan"
  }
}