{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 15,
  "chunk_index": 11,
  "total_chunks": 15,
  "text": "small groups and independently to complete class activities and tasks.Classes are delivered in person and/or online. You must complete all the following assessments to complete English Advanced Plus. Understand lengthy, complex texts related to academic or professional contexts Scan long and complex texts to locate relevant information Understand complex referenced texts with stated and unstated opinions and points of view Understand complex extended messages and technical information Follow arguments in complex presentations and documentaries Follow extended discussions, debates and interviews Write a critical response evaluating multiple texts Write an annotated bibliography Give a clear, well-structured presentation on a complex topic Take part in team negotiations Exchange ideas fluently and in social or academic discussions | 2025 Tuition fees per week of study | AU$520 Enrolment fee | AU$260 2025Tuition fees per week of studyAU$520Enrolment feeAU$260*Fees are listed in Australian dollars 2025Tuition fees per week of studyAU$520Enrolment feeAU$260 AU$260 *Fees are listed in Australian dollars Replacment document | Fee English for Academic Purposes replacement Statement of Attendance | AU$10 English for Academic Purposes replacement Statement of Course Results (final results for one level studied) | AU$10 English for Academic Purposes replacement completed set of Statement of Course Results (final results for each level studied) | AU$20 In addition to tuition fees you also need to pay forOverseas Student Health Cover (OSHC).Student visa holders must have cover for the total duration of their visa.You also need to account for your living expenses. Estimate thecost of livingin Melbourne.You do not need to pay theStudent Services and Amenities fee (SSAF)for the EAP program. The SSAF fee applies to other RMIT programs, including Foundation Studies.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 17819,
    "end_char": 19700,
    "category": "quick-course-scan"
  }
}