{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 15,
  "chunk_index": 9,
  "total_chunks": 15,
  "text": "also participate in regular group discussions (tutorials) which will develop your speaking and listening skills. You must complete all the following assessments to complete English Upper Intermediate. SkillAssessment taskReadingQuizzes and examinationListeningQuizzes and examinationWritingMid-course and final examinationSpeakingTutorials and group oral presentation Quizzes and examination Tutorials and group oral presentation Scan to locate relevant information in short articles or reports Follow the argument in texts presenting a point of view Understand information presented in a complex graphic Follow lengthy instructions Understand main ideas and specific information in lectures Follow the main points and details of a discussion or interview Predict the structure of information presented in a range of listening genres Write a well-structured paragraph Form paragraphs into a well-structured essay Write a short report using statistics and graphics Express views and feelings in reflective writing pieces Explain a problem, give details and explore causes and effects Participate in social and academic discussions, expressing opinions, giving information and sharing feelings Speaking | Tutorials and oral presentation Develop academic skills to prepare for university.What you will learnYou will learn grammar and vocabulary that will help you to understand complex texts. You will practice listening to lectures and writing academic essays and you will also participate in regular group discussions (tutorials) which will develop your speaking and listening skills.DeliveryYou will work in pairs, small groups and independently to complete class activities and tasks.Classes are delivered in person and/or online.AssessmentsYou must complete all the following assessments to complete English Advanced. Develop academic skills to prepare for university. You must complete all the following assessments to complete English Advanced.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 15146,
    "end_char": 17094,
    "category": "quick-course-scan"
  }
}