{
  "page_title": "Introduction to Translating and Interpreting Skill Set",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/skill-sets/s0148",
  "page_index": 29,
  "chunk_index": 2,
  "total_chunks": 8,
  "text": "ready to apply these capabilities in your life and work. The world is constantly changing, and there are universal skills that can help you adapt to the evolving nature of work and global engagement. As part of your study experience at RMIT, we provide 6 future-focused RMIT Capabilities: Ethical Global Citizens Connected Adaptive Digitally Adept Expert Critically Engaged. RMIT Capabilities are built into your course as well as some of our extracurricular experiences. They inform the design and delivery of your learning activities and assessments, so by the time you graduate, you’ll be ready to apply these capabilities in your life and work. These skill sets have been developed with extensive input from industry to ensure your learning prepares you effectively for current and future industry needs.At RMIT, we liaise with an Industry Advisory Committee, representing a broad cross-section of the translating and interpreting industry as well as key stakeholders including government. It advises on training and assessment, ensuring this course produces graduates with the skills needed in the field.All teaching staff are NAATI-qualified translators or interpreters with current experience to ensure you are equipped with the most current, relevant skills and knowledge. These skill sets have been developed with extensive input from industry to ensure your learning prepares you effectively for current and future industry needs. At RMIT, we liaise with an Industry Advisory Committee, representing a broad cross-section of the translating and interpreting industry as well as key stakeholders including government. It advises on training and assessment, ensuring this course produces graduates with the skills needed in the field. All teaching staff are NAATI-qualified translators or interpreters with current experience to ensure you are equipped with the most current, relevant skills and knowledge.",
  "structured_data": {
    "course_code": "S0148",
    "campus": "classes"
  },
  "metadata": {
    "start_char": 3495,
    "end_char": 5410,
    "category": "quick-course-scan"
  }
}