{
  "page_title": "Master of Cyber Security - Plan MC159P25",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/postgraduate-study/masters-by-coursework/master-of-cyber-security-mc159/mc159p25auscy",
  "page_index": 72,
  "chunk_index": 1,
  "total_chunks": 4,
  "text": "hain Applications | 12 | INTE2679 | City Campus Blockchain Case Studies | 12 | INTE2681 | City Campus Blockchain/Web3 Platforms and Strategies | 12 | INTE2572 | City Campus CRICOS code: 116688K To graduate you must complete the following. All courses listed may not be available each semester. To graduate from the Master of Cyber Security you must complete the following: Note: All Courses listed may not be available each semester Ten (10) Core Courses Combination 1:Twenty-Four (24) credit points from the Project Combination and Forty-Eight (48) credit points from one of the Cyber Security Option Lists or; The Cyber Security Options Courses Lists can be found at the end of the Program Structure. The Courses in each Option need to be completed in the sequence listed. Year One of Program Students must complete a series of compulsory onboarding modules during their first semester or study period. Complete 96 credit points from the following:Course TitleCredit PointsCourse CodeCampusIntroduction to Cyber Security12INTE2665City CampusProgramming Fundamentals12COSC2531City CampusData Communication and Net-Centric Computing12COSC3113City CampusPractical Data Science with Python12COSC2670City CampusSecurity in Computing and Information Technology12COSC3146City CampusSecure Software Systems12INTE2667City CampusDigital Risk Management and Information Security12INTE1002City CampusEthical Hacking and Security Testing12INTE2580City Campus Introduction to Cyber Security INTE2665 City Campus Programming Fundamentals COSC2531 Data Communication and Net-Centric Computing COSC3113 Practical Data Science with Python COSC2670 Security in Computing and Information Technology COSC3146 Secure Software Systems INTE2667 Digital Risk Management and Information Security INTE1002 Ethical Hacking and Security Testing INTE2580 Year Two of Program COSC3130 Case Studies in Data Protection and Privacy INTE2669 Project Combination Complete 24 credit points from the following:Course TitleCredit PointsC",
  "structured_data": {
    "course_code": "MC159",
    "credit_points": "96",
    "campus": "Introduction to Cyber Security | 12 | INTE2665 | City Campus Programming Fundamentals | 12 | COSC2531 | City Campus Data Communication and Net-Centric Computing | 12 | COSC3113 | City Campus Practical Data Science with Python | 12 | COSC2670 | City Campus Security in Computing and Information Technology | 12 | COSC3146 | City Campus Secure Software Systems | 12 | INTE2667 | City Campus Digital Risk Management and Information Security | 12 | INTE1002 | City Campus Ethical Hacking and Security Testing | 12 | INTE2580 | City Campus Computing Research and Project Preparation | 12 | COSC3130 | City Campus Case Studies in Data Protection and Privacy | 12 | INTE2669 | City Campus Cyber Security Postgraduate Project | 24 | INTE2671 | City Campus Minor Thesis/Project | 36 | COSC2179 | City Campus Minor Thesis/Project Part A | 24 | COSC2389 | City Campus Minor Thesis/Project Part B | 12 | COSC2390 | City Campus Cyber Attack Analysis and Incident Response | 12 | INTE2673 | City Campus Computer and Internet Forensics | 12 | COSC3135 | City Campus Cloud Security | 12 | INTE2691 | City Campus Human-Centered Security | 12 | INTE2675 | City Campus Discrete Mathematics | 12 | MATH2415 | City Campus Cryptography for Cyber Security | 12 | INTE2655 | City Campus Coding for Cyber Communication | 12 | INTE2656 | City Campus Frontiers of Applied Cryptography | 12 | INTE1127 | City Campus Fundamentals of Cyber Security | 12 | ISYS3442 | City Campus Governance and Change in Digital Business | 12 | INTE2412 | City Campus Cyber Security Governance Risk and Compliance Management | 12 | ISYS3439 | City Campus Cyber Security Resilience and Incident Management | 12 | ISYS3440 | City Campus Blockchain Fundamentals | 12 | INTE2677 | City Campus Blockchain Applications | 12 | INTE2679 | City Campus Blockchain Case Studies | 12 | INTE2681 | City Campus Blockchain/Web3 Platforms and Strategies | 12 | INTE2572 | City Campus CRICOS code: 116688K To graduate you must complete the following"
  },
  "metadata": {
    "start_char": 1800,
    "end_char": 3800,
    "category": "quick-course-scan"
  }
}