{
  "page_title": "Application dates",
  "page_url": "https://www.rmit.edu.au/study-with-us/applying-to-rmit/local-student-applications/application-dates",
  "page_index": 1,
  "chunk_index": 3,
  "total_chunks": 5,
  "text": "yBachelor of Architectural Design 31 May Bachelor of Architectural Design Timely close dateCourse31 MayMaster of Architecture Master of Architecture Semester 1 intakeApplications open on 28 July 2025.Applications will be accepted for each program until all places are filled, so ensure you apply as early as possible for your application to be considered. Late applications may result in a delayed class commencement.The following programs have timely close dates that you will need to submit your application by the below dates. Late applications may continue to be accepted after these dates if places are still available:Timely close dateCourseTBCTBCTimely close dateCourseTBCTBCTimely close dateCourseTBCTBC Semester 1 intake Applications open on 28 July 2025.Applications will be accepted for each program until all places are filled, so ensure you apply as early as possible for your application to be considered. Late applications may result in a delayed class commencement.The following programs have timely close dates that you will need to submit your application by the below dates. Late applications may continue to be accepted after these dates if places are still available:Timely close dateCourseTBCTBCTimely close dateCourseTBCTBCTimely close dateCourseTBCTBC Applications open on 28 July 2025.Applications will be accepted for each program until all places are filled, so ensure you apply as early as possible for your application to be considered. Late applications may result in a delayed class commencement.The following programs have timely close dates that you will need to submit your application by the below dates. Late applications may continue to be accepted after these dates if places are still available: Applications open on 28 July 2025. The following programs have timely close dates that you will need to submit your application by the below dates.",
  "structured_data": {
    "intake": "for which you can submit a direct application to RMIT"
  },
  "metadata": {
    "start_char": 4889,
    "end_char": 6771,
    "category": "quick-course-scan"
  }
}