{
  "page_title": "Prepare to Work Safely in the Construction Industry",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/skill-sets/prepare-to-work-safely-in-the-construction-industry-s0142",
  "page_index": 28,
  "chunk_index": 0,
  "total_chunks": 4,
  "text": "OHS legislative requirementsSafe work practicesConstruction hazards and control measuresOHS communication and reporting processesRole of designated OHS personnelSafety signs and symbolsRelevant authorities for reporting hazards and incidentsOHS incident response proceduresEmergencies, PPE and Fire safety equipmentAll relevant course notes will be supplied with comprehensive instructions, exercises and assessments. Please bring photo ID and pen, paper and/or laptop for notetaking. OHS legislative requirements Safe work practices Construction hazards and control measures OHS communication and reporting processes Role of designated OHS personnel Safety signs and symbols Relevant authorities for reporting hazards and incidents OHS incident response procedures Emergencies, PPE and Fire safety equipment All relevant course notes will be supplied with comprehensive instructions, exercises and assessments. Please bring photo ID and pen, paper and/or laptop for notetaking. CI Whitecard is delivered as a single-day course. Classes run between 9am - 4pm on Thursdays. Additional days may become available.Please refer to the Apply page for Application and Delivery dates. CI Whitecard is delivered as a single-day course. Classes run between 9am - 4pm on Thursdays. Additional days may become available. Please refer to the Apply page for Application and Delivery dates. This program is only offered as a full-fee program. 2025 full-fee place: AU$250* total Use ourfee finderto get an estimate of your fees for this program. Should your specific class be cancelled for any reason you will be notified via email and your fees will be credited towards an alternate date. Should you decide not to choose an alternate study study date, you can apply for a refund of fees paid as per the standardrefund process.If you cannot attend on the day you have enrolled in you will need to drop the class BEFORE the day to ensure that you are not liable for the fees paid.",
  "structured_data": {
    "course_code": "S0142"
  },
  "metadata": {
    "start_char": 0,
    "end_char": 1963,
    "category": "quick-course-scan"
  }
}