{
  "page_title": "Short courses and microcredentials",
  "page_url": "https://www.rmit.edu.au/study-with-us/short-courses",
  "page_index": 30,
  "chunk_index": 10,
  "total_chunks": 30,
  "text": "ks | NEXT START 11 Aug 2025Prevent attacks, mitigate risk and get up to speed with best-practice cyber security governance. Cyber Security Risk and Strategy Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 11 Aug 2025 FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 11 Aug 2025 Prevent attacks, mitigate risk and get up to speed with best-practice cyber security governance. Cyber Security Foundations for Business ProfessionalsIcon / Small / CalendarCreated with Sketch.03 Jan 2025 - 23 Jan 2028Icon / Small / LocationCreated with Sketch.MICROCREDENTIAL | Duration 12 weeks | Online | NEXT INTAKE TBCThis microcredential is designed for business professionals seeking skills in cyber security governance and risk management to support their transition to roles in the cyber security sector. Cyber Security Foundations for Business Professionals Icon / Small / CalendarCreated with Sketch.03 Jan 2025 - 23 Jan 2028 03 Jan 2025 - 23 Jan 2028 Icon / Small / LocationCreated with Sketch.MICROCREDENTIAL | Duration 12 weeks | Online | NEXT INTAKE TBC MICROCREDENTIAL | Duration 12 weeks | Online | NEXT INTAKE TBC This microcredential is designed for business professionals seeking skills in cyber security governance and risk management to support their transition to roles in the cyber security sector. Data StorytellingIcon / Small / CalendarCreated with Sketch.04 Jan 2025 - 31 Dec 2028Icon / Small / LocationCreated with Sketch.FUTURE SKILLS SHORT COURSE | 6 weeks | NEXT START 11 Aug 2025Master data storytelling with Microsoft’s Power BI platform. Transform complex information into compelling narratives that drive informed decisions and impactful business outcomes. Data Storytelling Icon / Small / CalendarCreated with Sketch.04 Jan 2025 - 31 Dec 2028 04 Jan 2025 - 31 Dec 2028 Master data storytelling with Microsoft’s Power BI platform.",
  "structured_data": {
    "duration": "12 weeks",
    "intake": "1 September 2025Explore AutoCAD (Windows) for design, drafting and modelling in this introductory course"
  },
  "metadata": {
    "start_char": 17199,
    "end_char": 19089,
    "category": "quick-course-scan"
  }
}