{
  "page_title": "Single courses",
  "page_url": "https://www.rmit.edu.au/study-with-us/single-courses",
  "page_index": 31,
  "chunk_index": 0,
  "total_chunks": 2,
  "text": "Undergraduate studyRMIT offers a range of bachelor, associate and honours degrees. Browse our undergraduate programs and find the right one for you. Undergraduate study RMIT offers a range of bachelor, associate and honours degrees. Browse our undergraduate programs and find the right one for you. Vocational studyIf you want to leap into industry or pursue further study, our diverse range of certificates, diplomas and advanced diplomas can get you there. Vocational study If you want to leap into industry or pursue further study, our diverse range of certificates, diplomas and advanced diplomas can get you there. Postgraduate studyBoost your career with a postgraduate qualification. Flexible study options include graduate certificates, graduate diplomas or masters degrees. Postgraduate study Boost your career with a postgraduate qualification. Flexible study options include graduate certificates, graduate diplomas or masters degrees. Apprenticeships and traineeshipsApprenticeships and traineeships combine training and employment. Learn on the job and earn money while studying a nationally recognised qualification. Apprenticeships and traineeships Apprenticeships and traineeships combine training and employment. Learn on the job and earn money while studying a nationally recognised qualification. Pre-university studiesRefresh your skills before undertaking further study. You can improve your English, complete foundation studies, or explore a new subject. Pre-university studies Refresh your skills before undertaking further study. You can improve your English, complete foundation studies, or explore a new subject. Study onlineEnjoy flexible study with RMIT Online, where you can discover practical skills and explore your career goals with a global focus. Study online Enjoy flexible study with RMIT Online, where you can discover practical skills and explore your career goals with a global focus.",
  "structured_data": {},
  "metadata": {
    "start_char": 0,
    "end_char": 1923,
    "category": "quick-course-scan"
  }
}