{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 15,
  "chunk_index": 5,
  "total_chunks": 15,
  "text": "n Write a description Prepare and give a short presentation on a familiar topic Give directions or instructions Participate in everyday transactions Ask and answer simple questions on personal and familiar topics Skill | Assessment task Reading | Examination Listening | Examination Writing | Examination Speaking | Examination Describe objects, places and people. You will learn to make arrangements, suggestions and how to give instructions. You will read different styles of text and practice listening and speaking. Classes are delivered in person and/or online. You must complete all the following assessments to complete English Pre-intermediate. SkillAssessment taskGrammar and VocabularyOnline testsReadingExaminationListeningExaminationWritingExaminationSpeakingExamination Examination Follow a sequence of directions or instructions Scan for important information in texts Understand the main points and details in simple descriptions, narratives or opinion texts Understand simple announcements, instructions or directions Follow a short description, opinion or narrative Follow and identify topic shifts in a short conversation Write a series of rules or instructions Write a simple narrative or description using structured paragraphs Manage transactional exchanges Give a sequence of simple directions or instructions Participate in simple conversations on a personal or familiar topic Skill | Assessment Task Learn grammar and vocabulary to use in study and in everyday life.What you will learnYou will write structured paragraphs and essays and describe graphs. You will practise reading and listening to news and other texts and you will express your opinions on a range of topics, supporting your ideas with reasons.DeliveryYou will work in pairs, small groups and independently to complete class activities and tasks.Classes are delivered in person and/or online.AssessmentsYou must complete all the following assessments to complete English Intermediate.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 8886,
    "end_char": 10860,
    "category": "quick-course-scan"
  }
}