{
  "page_title": "Find a course | Study at RMIT",
  "page_url": "https://www.rmit.edu.au/study-with-us",
  "page_index": 0,
  "chunk_index": 1,
  "total_chunks": 6,
  "text": "crocredentialsBuild new and in-demand skills with RMIT short courses and microcredentials - standalone learning with on online and in-person options designed to support your personal and career goals. Short courses and microcredentials Build new and in-demand skills with RMIT short courses and microcredentials - standalone learning with on online and in-person options designed to support your personal and career goals. Single coursesSingle course study allows you to expand your knowledge and experience the same classes as undergraduate and postgraduate degree students. Single courses Single course study allows you to expand your knowledge and experience the same classes as undergraduate and postgraduate degree students. Study online ArchitectureUsing cutting edge technology, you can explore architecture, landscape architecture and interior design at a top-ranking university. Architecture Using cutting edge technology, you can explore architecture, landscape architecture and interior design at a top-ranking university. ArtDiscover your creative practice through fine and visual art, photography and more at the university ranked #1 for art and design. Discover your creative practice through fine and visual art, photography and more at the university ranked #1 for art and design. Aviation Biomedical sciencesDiscover how pharmaceutical, laboratory and biomedical science fields can change lives and communities. Biomedical sciences Discover how pharmaceutical, laboratory and biomedical science fields can change lives and communities. BuildingLearn a trade, discover project and construction management, or delve into property and valuation when you study building. Building Learn a trade, discover project and construction management, or delve into property and valuation when you study building. BusinessExplore the future of business, from accounting, finance and management to blockchain, marketing and entrepreneurship.",
  "structured_data": {},
  "metadata": {
    "start_char": 1661,
    "end_char": 3603,
    "category": "quick-course-scan"
  }
}