{
  "page_title": "English for Academic Purposes (EAP)",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/pre-university-study/english-language/english-language-pathways",
  "page_index": 15,
  "chunk_index": 2,
  "total_chunks": 15,
  "text": "25Thurs 25/09/25 (*TBC)8Fri 03/10/25Mon 06/10/25Fri 07/11/259Fri 07/11/25Mon 10/11/25Fri 12/12/25 Module Orientation Course start date Course end date Fri 03/01/25 Mon 06/01/25 Fri 07/02/25 Mon 10/02/25 Fri 14/03/25 Mon 17/03/25 Thurs 17/04/25 Thurs 24/04/25 Mon 28/04/25 Fri 30/05/25 Mon 02/06/25 Fri 04/07/25 Fri 18/07/25 Mon 21/07/25 Fri 22/08/25 Mon 25/08/25 Thurs 25/09/25 (*TBC) Fri 03/10/25 Mon 06/10/25 Fri 07/11/25 Mon 10/11/25 Fri 12/12/25 Public holidays RMIT Melbourne is closed on public holidays. Plan ahead by checking when they take place at theBusiness Victoria website. We offer face-to-face English language teaching in the CBD of Melbourne, Australia. This is in accordance with theEducation Services for Overseas Students (ESOS) Actanddirectives announced by the Australian Governmentin October 2022 which require international students who hold an Australian student visa to return to study in Australia from 30 June. RMIT UP is located at:RMIT Building 85, Level 1, 97-99 Franklin Street.RMIT UP is located at RMIT’s Melbourne City campus, in the heart of Melbourne. We are conveniently located between Swanston Street and Elizabeth street, just a short walk from Melbourne Central Station.The campus has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025).RMIT offers a free* service that collects you from the airport and takes you to your pre-arranged accommodation. Please refer toPrepare to arrive webpagefor more information.Otherwise, you can catch a taxi or take theSkybusinto the city centre.*Conditions apply RMIT UP is located at:RMIT Building 85, Level 1, 97-99 Franklin Street.RMIT UP is located at RMIT’s Melbourne City campus, in the heart of Melbourne. We are conveniently located between Swanston Street and Elizabeth street, just a short walk from Melbourne Central Station.",
  "structured_data": {
    "duration": "10 weeks",
    "campus": "has easy access to the city’s many trams and train stations including Melbourne Central train station, Elizabeth Street and Swanston Street trams and the new State Library Station, part of the Metro Tunnel project (open in 2025)",
    "intake": "for new students every five weeks"
  },
  "metadata": {
    "start_char": 3532,
    "end_char": 5520,
    "category": "quick-course-scan"
  }
}