{
  "page_title": "Master of Clinical Osteopathy - Plan MC284",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/postgraduate-study/masters-by-coursework/master-of-clinical-osteopathy-mc284/mc284ausbu",
  "page_index": 60,
  "chunk_index": 1,
  "total_chunks": 2,
  "text": "the following. All courses listed may not be available each semester. Year One of Program Students must complete a series of compulsory onboarding modules during their first semester or study period. Complete 96 credit points from the following:Course TitleCredit PointsCourse CodeCampusFoundations in Public Health12MEDS2211Bundoora CampusOsteopathic Clinical Practice 112REHA2248Bundoora CampusOsteopathic Clinical Skills 112REHA2249Bundoora CampusPain Science and Management12REHA2250Bundoora CampusDifferential Diagnosis in Western Medicine12MEDS2155Bundoora CampusOsteopathic Clinical Skills 212REHA2252Bundoora CampusOccupational Rehabilitation and Adjunctive Therapies12REHA2253Bundoora CampusOsteopathic Clinical Practice 212REHA2254Bundoora Campus Foundations in Public Health MEDS2211 Bundoora Campus Osteopathic Clinical Practice 1 REHA2248 Osteopathic Clinical Skills 1 REHA2249 Pain Science and Management REHA2250 Differential Diagnosis in Western Medicine MEDS2155 Osteopathic Clinical Skills 2 REHA2252 Occupational Rehabilitation and Adjunctive Therapies REHA2253 Osteopathic Clinical Practice 2 REHA2254 Year Two of Program Advanced Therapeutic Exercise REHA2251 Business and Entrepreneurship in Health REHA2277 Osteopathic Clinical Skills 3 REHA2256 Osteopathic Clinical Practice 3 REHA2288 Osteopathic Clinical Practice 4 REHA2289 Osteopathic Professional Practice Portfolio OHTH4259",
  "structured_data": {
    "course_code": "MC284",
    "credit_points": "96",
    "campus": "Foundations in Public Health | 12 | MEDS2211 | Bundoora Campus Osteopathic Clinical Practice 1 | 12 | REHA2248 | Bundoora Campus Osteopathic Clinical Skills 1 | 12 | REHA2249 | Bundoora Campus Pain Science and Management | 12 | REHA2250 | Bundoora Campus Differential Diagnosis in Western Medicine | 12 | MEDS2155 | Bundoora Campus Osteopathic Clinical Skills 2 | 12 | REHA2252 | Bundoora Campus Occupational Rehabilitation and Adjunctive Therapies | 12 | REHA2253 | Bundoora Campus Osteopathic Clinical Practice 2 | 12 | REHA2254 | Bundoora Campus Advanced Therapeutic Exercise | 12 | REHA2251 | Bundoora Campus Business and Entrepreneurship in Health | 12 | REHA2277 | Bundoora Campus Osteopathic Clinical Skills 3 | 12 | REHA2256 | Bundoora Campus Osteopathic Clinical Practice 3 | 12 | REHA2288 | Bundoora Campus Osteopathic Clinical Practice 4 | 12 | REHA2289 | Bundoora Campus Osteopathic Professional Practice Portfolio | 12 | REHA2264 | Bundoora Campus Research Project A | 12 | OHTH4261 | Bundoora Campus Research Project B | 12 | OHTH4259 | Bundoora Campus To graduate you must complete the following"
  },
  "metadata": {
    "start_char": 1148,
    "end_char": 2552,
    "category": "quick-course-scan"
  }
}