{
  "page_title": "Introduction to Translating and Interpreting Skill Set",
  "page_url": "https://www.rmit.edu.au/study-with-us/levels-of-study/vocational-study/skill-sets/introduction-to-translating-and-interpreting-skill-set-s0174",
  "page_index": 27,
  "chunk_index": 1,
  "total_chunks": 8,
  "text": "designed to provide meaningful engagement with staff, industry and peers and provide for access and use of spaces where learning can be applied and active, including an array of specialised equipment.Most RMIT courses do not include passive large-scale classes such as lectures, instead the content traditionally provided in lectures is made available online. This may be in the form of readings, videos or other on-demand learning materials. This content will also support the basis of interactive learning that takes place in on-campus classes. The types of classes you have will depend on the course you’re studying. Classes are offered in various formats designed to provide meaningful engagement with staff, industry and peers and provide for access and use of spaces where learning can be applied and active, including an array of specialised equipment. Most RMIT courses do not include passive large-scale classes such as lectures, instead the content traditionally provided in lectures is made available online. This may be in the form of readings, videos or other on-demand learning materials. This content will also support the basis of interactive learning that takes place in on-campus classes. The world is constantly changing, and there are universal skills that can help you adapt to the evolving nature of work and global engagement.As part of your study experience at RMIT, we provide 6 future-focused RMIT Capabilities:Ethical Global CitizensConnectedAdaptiveDigitally AdeptExpertCritically Engaged.RMIT Capabilities are built into your course as well as some of our extracurricular experiences. They inform the design and delivery of your learning activities and assessments, so by the time you graduate, you’ll be ready to apply these capabilities in your life and work. The world is constantly changing, and there are universal skills that can help you adapt to the evolving nature of work and global engagement.",
  "structured_data": {
    "course_code": "S0174",
    "campus": "classes"
  },
  "metadata": {
    "start_char": 1762,
    "end_char": 3695,
    "category": "quick-course-scan"
  }
}